const DATA =
{
    gequ:
    {
        language: "zh",
        nav: "歌曲",
        classification:
        {
            dl:
            {
                nav: "大陆",
                header: {h1: "大陆歌"},
                main:
                {
                    NQDPYLXH:
                    {
                        h2: "年轻的朋友来相会",
                        preface:
                        [
                            "本来没觉得有啥特点，不值得拿出来分享……", LB,
                            [TAG.J2C, "记谱老师"], "无意间又听到了，随手打起了拍子。打着打着兴趣来了，反复打了好几遍——" +
                            "咦？有点儿怪啊！每小节到底几拍？记完谱后才发现太特别了" + EMOJI.SURPRISE, PB,
                            "谷老师真不愧为首屈一指的作曲家！！！"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "V0",
                                    chords:
                                    [
                                        [
                                            {1: G, 8: Gadd9B},
                                            {1: GD, 7: A7sus4E},
                                            {1: GD, 5: AmE, 9: Bm7},
                                            {1: G, 5: Dsus4, 9: G, 10: G7}
                                        ],
                                        [
                                            {3: EmB},
                                            {1: C, 6: Em7B},
                                            {1: Gadd9D, 5: Dsus4},
                                            {1: GD, 5: A7sus2E, 10: Dsus4, 12: G}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "年轻的朋友们 今天来相会",
                                "荡起小船儿 暖风轻轻吹",
                                "花儿香 鸟儿鸣 春光惹人醉",
                                "欢歌笑语绕着彩云飞",
                                "啊 亲爱的朋友们",
                                "美妙的春光属于谁",
                                "属于我 属于你",
                                "属于我们八十年代的新一辈"
                            ]
                        },
                        postscript:
                        [
                            "要时刻注意节拍的切换！", PB,
                            "第4句第1个用小3也行。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "各版本的前奏大多是把高潮改一改，就拿来用了。直到看了2011年在CCTV任、吴两位老师再次合作的视频，" +
                                "决定用它的前奏！从原调开始，经过3次升调，再回到原调。乍一听有点儿怪？其实转得很自然！", LB,
                                "选调和曲速都是参照两位老师早年合作的版本。", PB,
                                "主旋律中有几句简单地分成俩声部错开唱。"
                            ]
                        }
                    },
                    CZ:
                    {
                        h2: "纯真",
                        preface:
                        [
                            "“Mm……”处是6转音！", LB,
                            "……"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "Q0",
                                    chords:
                                    [
                                        [
                                            {1: D},
                                            {1: BmFs},
                                            {1: DA, 5: G},
                                            {0: Bm, 10: [FWS, AE]}
                                        ],
                                        [
                                            {1: D6},
                                            {1: BmFs},
                                            {1: Bm7},
                                            {1: sFmCs, 5: [FWS, G], 7: Bm, 11: AE, 12: A, 13: A7E}
                                        ],
                                        [
                                            {1: DFs, 7: Asus4},
                                            {2: GD, 10: A},
                                            {1: DFs, 7: Asus4},
                                            {3: Bm, 7: GM7, 11: DFs}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "每扇门 每个人",
                                "每一道深浅的年轮",
                                "就像自己的掌纹",
                                "交错在记忆里的 余温 Mm……",
                                "你从来 都不问",
                                "每一次相遇的眼神",
                                "就像注定的纯真",
                                "一起经历过 情感才最深",
                                "恋上一个人 爱她的天真",
                                "恋着一个人 就爱他一直那么真",
                                "轻轻推开门 有你的体温",
                                "岁月不用问 那就是我们"
                            ]
                        },
                        postscript:
                        [
                            "……", LB,
                            "……"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "……", LB,
                                "……"
                            ]
                        }
                    },
                    CTZL:
                    {
                        h2: "从头再来",
                        preface:
                        [
                            "旋律轻松、俏皮，歌词朴实、有趣，还真适合喜剧！", LB,
                            "高潮前两句用的是电视原声中结束段的词儿。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "Q0",
                                    chords:
                                    [
                                        [
                                            {1: DA, 5: D, 7: sFm7Cs, 11: DA},
                                            {1: Dsus4, 4: sFm7, 8: G, 12: A, 13: Aaug},
                                            {1: DA, 5: D, 7: sFm7, 11: DA},
                                            {1: Dsus4, 4: sFm7, 8: GM7, 12: D, 13: A}
                                        ],
                                        [
                                            {1: Dsus2, 3: sFmCs, 5: E7sus2, 8: A, 9: A7E},///
                                            {1: DA, 5: Gadd9, 9: A6, 10: D, 11: sCdim}
                                        ],
                                        [
                                            {1: Bm, 3: Dsus2, 5: G, 8: A},
                                            {1: Bm, 3: sFm, 6: A6, 9: D},
                                            {1: Bm, 3: Dsus2, 5: G, 8: A},
                                            {1: Bm, 3: sFm, 5: A6, 7: D}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "有个好差使 谁来试一试",
                                "你争么他来抢 究竟谁合适",
                                "来了一个你 来了一个他",
                                "你看那来来往往叫我怎么办",
                                "没有烦恼怎叫人生",
                                "甜的酸的苦的辣的滋味",
                                "爱过恨过哭过笑过",
                                "时光匆匆 快乐着过",
                                "下定决心排除万难",
                                "一切从头再来过"
                            ]
                        },
                        postscript: "增、减3的效果好像还不错噢？",
                        details:
                        {
                            demo: TAG.audio,
                            comment: "前奏里加了几个经过音。"
                        }
                    },
                    DXSH:
                    {
                        h2: "丹心似火",
                        preface:
                        [
                            "突然发现有专辑版！但感觉没片头唱得好？", LB,
                            "第1遍的副歌前多了一个空小节，与电视原声不同。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "u1",
                                    arranged: "t0",
                                    chords:
                                    [
                                        [
                                            {1: Dm, 5: AmE},
                                            {1: FM7, 7: Am},
                                            {1: Dm, 5: AmE},
                                            {1: bBM7, 5: CG, 7: Dm}
                                        ],
                                        [
                                            {3: Dsus4A, 7: C},
                                            {3: G7sus2, 7: Dsus2},
                                            {3: FM7, 7: Gm7D},
                                            {3: Am7, 7: AmE}
                                        ],
                                        [
                                            {3: bB, 5: CE, 7: Dm},
                                            {3: DmA, 5: C, 7: Am},
                                            {2: bBM7F, 4: Gm, 5: AmE, 7: Am7},
                                            {3: Dsus4, 7: C, 9: Dm}
                                        ],
                                        [
                                            {3: bB, 5: CE, 7: Dm},
                                            {3: DmA, 5: C, 7: Am},
                                            {2: bBM7F, 4: Gm, 5: AmE, 7: bBadd9F},
                                            {3: DmA, 7: Gsus2, 9: Dm}
                                        ],
                                        [
                                            {1: Gm, 2: Am, 3: Dm}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "夜凭栏 半月起",
                                "义薄云天仰美酒",
                                "破云烟 驱妖雾",
                                "坦荡胸襟忠魂住",
                                "头可断 命可弃",
                                "丹心热血参天地",
                                "辩是非 断心迷",
                                "横扫魔障奋马蹄",
                                "一声长啸震鬼蜮",
                                "大道青天任我去",
                                "俯瞰人间寻常里",
                                "雷霆怒吼霞光朗天地",
                                "一声长啸震鬼蜮",
                                "大道青天任我去",
                                "俯瞰人间寻常里",
                                "雷霆怒吼霞光朗天地",
                                "朗天地"
                            ]
                        },
                        postscript:
                        [
                            "第2句中的", [TAG.CHORD, FM7], "可以拆成Dm/F和C/E。", LB,
                            "第4句中的", [TAG.CHORD, bBM7], "也可以转F。", PB,
                            [TAG.CHORD, bBadd9F], "夸张了点儿？简化成", [TAG.CHORD, bB], "也行。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "前奏音太高了？低了不太好编。", LB,
                                "高潮处的节奏好像不太好？"
                            ]
                        }
                    },
                    HKRNF:
                    {
                        h2: "海阔任鸟飞",
                        preface:
                        [
                            "歌名不错！把耳熟能详的诗词重新组合了一下。", LB,
                            "主歌部分省略了第2段。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "R2",
                                    arranged: "Q0",
                                    chords:
                                    [
                                        [
                                            {0: D, 7: Em7B},
                                            {0: Esus2, 6: [FWS, A6sus4]},
                                            {1: sFmCs, 5: Gadd9B},
                                            {1: A7E, 8: Em7B, 11: Aadd11E, 14: [FWS, Dsus4], 16: D7A, 18: G, 20: Asus2, 21: Aaug, 23: DA}
                                        ],
                                        [
                                            {1: Dsus4, 7: D7Fs},
                                            {1: Gadd9D, 9: A7sus2E},
                                            {1: Gadd9D, 7: Bm},
                                            {1: sFsus4, 6: [FWS, A6], 10: A7, 12: AM7}
                                        ],
                                        [
                                            {1: D7Fs, 4: G},
                                            {1: AE, 4: sCm7b5},
                                            {1: Bm7Fs, 2: [FWS, A6], 4: [FWS, D]},
                                            {1: Bm7Fs, 2: [FWS, A6], 4: [FWS, D]}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "曾经是海岸线堆积的汗水",
                                "怎抹得去大海咸涩的滋味",
                                "云来了 帆来了",
                                "海市蜃楼都不会让我 迷失陶醉",
                                "亲近海水 （亲近海水）",
                                "浇湿我的心绪 （我的心绪）",
                                "亲近海水 （海水……）",
                                "洗去我的劳累 （啦啦啦啦）",
                                "彼此 相亲",
                                "年年 岁岁",
                                "海阔 任鸟飞",
                                "海阔 任鸟飞"
                            ]
                        },
                        postscript:
                        [
                            "曲风很特别，不像是传统大陆歌！因此某些《大招》就可以施展出来了" + EMOJI.HAPPY, PB,
                            "两个《套餐》蛮有味道的噢？",
                            [
                                TAG.ul,
                                [
                                    [
                                        "Asus2" + ARROW + "Aaug" + ARROW + "D", LB,
                                        "间奏的和弦进行是参考了某视频后改编而成的。增和弦嵌在常规的和弦连接中，会溢出哀愁的感觉！", LB,
                                        "如果见招拆招的话，前4个换成A7/E" +
                                        ARROW + "Em7/G" + ARROW + "Bsus4" + ARROW + "Dm大概也行？"
                                    ],
                                    [
                                        "A6" + ARROW + "A7" + ARROW, [TAG.CHORD, AM7], LB,
                                        "由花音受到的启发。"
                                    ]
                                ]
                            ], LB,
                            "半减的效果好像还不错噢？"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment: "最后一句词儿可以再唱1遍，作为结束句。"
                        }
                    },
                    HHAN:
                    {
                        h2: "好好爱你",
                        preface:
                        [
                            "...", LB,
                            "..."
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "V0",
                                    chords:
                                    [
                                        [
                                            {1: GD, 4: Gadd9, 8: Bm7Fs, 10: G7B},
                                            {1: CE, 3: Am7, 7: [FWS, D6], 9: D7sus4A, 11: D6sus4A},
                                            {2: BmFs, 6: D7sus2, 10: CM7, 14: D6A},
                                            {2: Am7E, 7: D6sus4A, 10: [FWS, GD]}
                                        ],
                                        [
                                            {1: Dadd9A, 5: [FWS, G], 8: D7A, 11: [FWS, GD]},
                                            {1: CM7G, 6: Cadd9E, 11: Am, 13: [DFWS, D6Fs], 15: [FWS, GB]},
                                            {1: Dadd9A, 5: [FWS, G], 8: sFm7b5A, 11: GB},
                                            {1: CM7G, 6: Cadd9E, 10: [FWS, Am], 11: [FWS, Dsus4], 13: [FWS, G]}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "猜 往心灵深处猜",
                                "爱 有你才够精彩",
                                "期待 一个温暖的所在 呕……",
                                "抱着你 还有什么不应该",
                                "现在已不在 未来未必来",
                                "终于明白 最美好的 是你的依赖",
                                "靠在你身边 再也不分开",
                                "感谢上天 把你交给我  安排"
                            ]
                        },
                        postscript:
                        [
                            "..." + EMOJI.HAPPY, PB,
                            "..."
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment: "前奏蛮特别的！有好几个半音。"
                        }
                    },
                    HXSHH:
                    {
                        h2: "欢喜上海话",
                        preface:
                        [
                            [TAG.J2C, "吴语指导老师"], "建议把歌名改了" + EMOJI.AWKWARD, PB,
                            "歌词是从网上拷来的，再由", [TAG.J2C, "老师"], "略加修改。", LB,
                            "因为方言中一部分汉字没有标准的写法，所以下面的歌词里有些用字与别处不同，" +
                            "其中还借用了粤语中的“嘅”和“咭”" + EMOJI.SHY, PB,
                            "主歌两段的旋律略有不同；副歌差得有点儿大。", LB,
                            "第2遍时过渡段的第1句，词儿变成“啥俄是……”"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "U1",
                                    arranged: "T0",
                                    chords:
                                    [
                                        [
                                            {4: F, 10: C6E},
                                            {3: Gm7, 11: C6},
                                            {4: bB, 11: C6},
                                            {3: Dm, 6: G7sus2, 8: [FWS, C], 10: C7E}
                                        ],
                                        [
                                            {4: Fadd9, 12: C6G},
                                            {3: Dm, 11: Fadd9A},
                                            {5: Dm, 9: C, 13: Dm7},
                                            {0: DmA, 4: bBF, 9: [FWS, bBadd9], 15: [FWS, C], 17: C7E}
                                        ],
                                        [
                                            {4: Am, 10: [FWS, AmC]},
                                            {3: Dm7, 9: Am},
                                            {3: Dm, 6: [FWS, bBF]},
                                            {5: bBM7, 9: [FWS, C], 11: C7E}
                                        ],
                                        [
                                            {3: F, 9: [FWS, Csus2]},
                                            {4: Dm7, 9: [FWS, Am]},
                                            {4: Gm7, 11: FC},
                                            {4: Dm, 6: bB, 8: [FWS, C]}
                                        ],
                                        [
                                            {3: F, 9: [FWS, Csus2]},
                                            {4: Dm7, 10: [FWS, Am]},
                                            {3: Gm7, 8: Dm7C},
                                            {3: C6G, 7: [FWS, Csus2], 9: F}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "楼上娥林阿姨 嘞嘅居委会做",
                                "每天到处解决纠纷 㛄勿怕辛苦",
                                "剃头俄小苏北 开差头崇明阿叔",
                                "最怕碰着㛄噜哩噜嗦",
                                "楼下俄美国老外 寻着个浦东太太",
                                "每天踏脚踏车上班 呕稀奇哇",
                                "做水产娥宁波阿姐  卖大饼山东阿哥",
                                "碰着伊拎勿清最头晕 还要拼命还价",
                                "啥佇是正宗咯上海闲话",
                                "从来啊没佇搞清爽过",
                                "反正从小到大",
                                "听到伊拉天天嘞嗨讲",
                                "阿拉欢喜讲上海闲话",
                                "勿怪是洋泾浜本地话",
                                "学起来有点难 学会了勿舍得掼",
                                "从侬好谢谢讲起来",
                                "阿拉欢喜讲上海闲话",
                                "从每个小囡到年纪一大把",
                                "开开心心勿容易吵相骂",
                                "日咭一天比一天好过"
                            ]
                        },
                        postscript:
                        [
                            "如果用《万能伴奏》，也是可以的。", PB,
                            "中间过渡段的头俩蛮难配的" + EMOJI.SAD
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "前奏中的半音蛮有味道！", LB,
                                "后面的节奏好像慢了点儿？"
                            ]
                        }
                    },
                    HuiY:
                    {
                        h2: "回音",
                        preface:
                        [
                            "一开始还以为是", [TAG.ALP, "台湾歌", "gequ/tw"], "。", LB,
                            "词儿写得不错！最欢喜第1句和最后两句" + EMOJI.SHY, PB,
                            "整体上分3个部分，各部都能分为前后两段，且各段也都有旋律相同、相似或不同之处。", LB,
                            "小转音特别多，尤其是某些句尾处音拖得很长，所以唱起来还是有点儿难度的！"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "W2",
                                    arranged: "V0",
                                    chords:
                                    [
                                        [
                                            {0: Gadd9, 9: A7sus2},
                                            {0: A7sus2E, 8: D},
                                            {0: G, 4: D6sus4A, 11: A7sus2E},
                                            {4: A7sus4, 13: D6, 15: C}
                                        ],
                                        [
                                            {0: Gadd9, 9: D6sus4},
                                            {0: A7sus2E, 8: D6},
                                            {0: G, 4: A7sus2, 11: E7sus4},
                                            {4: A7sus4, 12: Em, 14: Bm7D}
                                        ],
                                        [
                                            {0: A7sus2E, 8: A7sus4},
                                            {0: A7sus2E, 9: D6},
                                            {0: A7sus2E, 8: A7sus2},
                                            {0: A7sus4E, 7: [FWS, Dsus4], 10: [FWS, Gadd9]}
                                        ],
                                        [
                                            {4: Cadd9, 9: Gadd9B, 13: A7sus2, 16: [FWS, Em]},
                                            {1: A7sus2, 5: Asus2E, 7: [FWS, CM7]},
                                            {0: D6A, 4: Cadd9, 8: Gadd9D, 13: Asus2, 17: BmD},
                                            {1: A7sus2, 5: C, 8: [FWS, D7]}
                                        ],
                                        [
                                            {0: Gadd9, 4: Cadd9, 9: Gadd9B, 13: A7sus2, 16: [FWS, Em]},
                                            {1: A7sus2, 5: D6, 7: [FWS, BmFs]},
                                            {0: D6A, 4: GM7, 8: E7sus4, 13: Bm7, 16: [FWS, Cadd9]},
                                            {1: A7sus2, 6: E7sus4, 8: [FWS, Gadd9B], 10: G}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "错过的恋情飘零 任风去打听",
                                "我跌入回忆的深井",
                                "一句句的叮咛 一段段的曾经",
                                "你像半满的酒瓶 我还在微醺 呵",
                                "那异域传来胡琴 在弹谁的心",
                                "弹画面不舍的梦境",
                                "一页页的风景 一幕幕的恋情",
                                "原来那过去还是跟我跟很紧……",
                                "论浮生坐看浮云  你曾如此地用心",
                                "付出很安静 却泪湿衣襟 耶",
                                "那苍天鸟瞰苍鹰  我俯视你的表情",
                                "是如何牵动我命运 喔",
                                "我终于很笃定 将誓言用印等你的决定",
                                "等一件美好的事情",
                                "等一切云淡风轻后 你会看到我的用心",
                                "等待是因为 我相信",
                                "我终于很笃定 将誓言用印等你的决定",
                                "等一种甜蜜的回音",
                                "等北方的湖不再结冰 你会发现我热情",
                                "等爱情 我永无止境"
                            ]
                        },
                        postscript:
                        [
                            "旋律相似的小节蛮多俄。为了避免重复，还是要花点儿心思。", LB,
                            "每小节俩和弦会方便点儿？"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "前奏中的半音蛮有味道！", LB,
                                "前奏可当尾奏用。"
                            ]
                        }
                    },
                    HuoY:
                    {
                        h2: "火焰",
                        preface:
                        [
                            "有几处和片头字幕不同：",
                            [
                                TAG.ul,
                                [
                                    "“……里（的）一束……”，补上了“的”；",
                                    [
                                        "“（不知不觉）成为你的永远”中有2处用词重复，后半句全改了！",
                                        [
                                            TAG.ul,
                                            [
                                                "“成为”上一句用过了；",
                                                "“永远”前后都用了。"
                                            ]
                                        ]
                                    ],
                                    "哦 → 哦呕呕；",
                                    "“……到永（永远）远”，补全了叠词。"
                                ]
                            ], LB,
                            "主歌第3句的第1个字儿，起唱点不一样——第2段比第1段早唱1拍。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "O0",
                                    chords:
                                    [
                                        [
                                            {1: Csus2G, 5: Am, 9: Dsus2},
                                            {1: FM7, 4: [FWS, Am], 9: Fadd9, 12: [FWS, Gsus4]},
                                            {3: EmB, 10: Am},
                                            {4: FM7, 11: [FWS, G], 13: G7D}
                                        ],
                                        [
                                            {1: Csus2G, 5: Am, 9: Dsus2},
                                            {1: FM7, 4: [FWS, Am], 8: Fadd9, 12: Gsus4},
                                            {3: EmB, 10: Am},
                                            {4: FM7, 11: [FWS, G7]}
                                        ],
                                        [
                                            {5: C, 12: [FWS, EmG]},
                                            {1: FM7C, 8: Dsus2, 11: [FWS, Am7E]},
                                            {5: C, 12: [FWS, EmG]},
                                            {1: FM7C, 5: AmE, 9: C}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "渴望在我生命里的每一个冬天",
                                "依偎在你 温柔的胸膛里面",
                                "忘了所有悲伤 所有疲倦",
                                "就这样抱着你 直到永远",
                                "想要成为你生命里一束火焰",
                                "不知不觉 梦想已经实现",
                                "再也没有忧伤 没有慌张",
                                "就这样幸福着 直到永远",
                                "哦呕呕 你是我的依恋 我是你的爱恋",
                                "每天每天相守 不会厌倦",
                                "哦呕呕 我是你的春天 你是我的火焰",
                                "岁岁年年相守 到永永远远"
                            ]
                        },
                        postscript:
                        [
                            "主歌两段的旋律略有不同，但和弦是共通的，注意下有几处位置不同。", LB,
                            "副歌处的Em/G，用G6好像也行。本来也考虑过（将其中1个）换成G7或其它变种，但感觉都不好。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "前奏很吸引人！几个简单的和弦，也能编出好的旋律" + EMOJI.SURPRISE, LB,
                                "前半部分的第1段可当尾奏用。大调开头、小调结尾？", LB,
                                "后半部分可用于间奏，但要弹两遍，第2遍的最后1小节有点儿变化。", PB,
                                "多处用到古筝音！用与不用，效果还真不一样噢？", PB,
                                "倒数第2句的“火焰”，用的是原曲第2遍中和声唱的旋律。"
                            ]
                        }
                    },
                    KLSSX:
                    {
                        h2: "快乐似神仙",
                        preface:
                        [
                            "四字歌词的最后1个字，唱出来反而是小节的第1拍，有点儿搞！", LB,
                            "高潮处选的是电视原声中第2遍的词儿。高潮的后2句，因为字数不同，所以两遍的旋律也略有不同。", LB,
                            "最后两句直接上的结束句。", PB,
                            "原曲的结束段升一个音。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "S0",
                                    chords:
                                    [
                                        [
                                            {4: E, 5: sCm7, 9: EB},
                                            {0: AM7, 4: sFm, 5: sCm7, 9: BFs},
                                            {0: sCm7, 4: EB, 5: sCm7, 9: EB},
                                            {0: AM7, 4: sFsus2, 6: Bsus2, 10: E}
                                        ],
                                        [
                                            {0: EB, 4: sCmE},
                                            {4: sGm},
                                            {4: AE},
                                            {3: Bsus2Fs, 7: Bsus4}
                                        ],
                                        [
                                            {2: sCm7Gs, 4: EB, 5: sCm7, 9: EB},
                                            {0: AM7, 4: sFm, 5: sCm7, 9: BFs},
                                            {0: sCm7, 4: EB, 5: sCm7, 9: EB},
                                            {0: AM7, 4: sFsus2, 6: sCm7B, 10: E}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "唱一段情  想给你听",
                                "清平世界  有苦有甜",
                                "闲坐一边  快乐神仙",
                                "怎不怕人间风云多变幻",
                                "为爱他等啊等啊等",
                                "为情他疼啊疼啊疼",
                                "就算那欢喜冤家",
                                "也能一路到白头",
                                "天地之间  一日百年",
                                "春梦不觉  化成云烟",
                                "做一辈子  快乐神仙",
                                "逍遥在人间走上一百年"
                            ]
                        },
                        postscript:
                        [
                            "第1段中的Bsus2可以换成更复杂的B6sus2或B6sus24；简单点儿就直接B或B7。", LB,
                            "副歌第1个E/B加上9音也行。", LB,
                            [TAG.CHORD, sCm7B], "可以换成Bsus24或Aadd9。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "一般不选较为麻烦的E调。但这个前奏有点儿特殊，用别的调编起来不是很方便。", LB,
                                "电视原声没有尾奏。"
                            ]
                        }
                    },
                    LLDXF:
                    {
                        h2: "老林的幸福",
                        preface:
                        [
                            "原曲叫《守护明天》，朱老师唱得很有味道！", LB,
                            "电视原声是精简版，听完后有两点感受颇深：",
                            [
                                TAG.ul,
                                [
                                    "这名儿不太对吧？歌词倒是和片名很搭！但直接把片名拿来当歌名，好像长了点儿？" +
                                    "此处就将高潮中反复唱到的词儿，来作歌名用了。",
                                    "主歌接副歌显得有点儿突兀，中间好像可以加个过渡段？"
                                ]
                            ],
                            "听完专辑版后，俩疑问都解决了……" + EMOJI.SURPRISE, PB,
                            "演唱时有几处要注意：",
                            [
                                TAG.ul,
                                [
                                    "“（英）雄不能”要用念白；",
                                    "“狗”要唱得夸张些；",
                                    "“（小两口）子”后面要拖个/ei/音出来；",
                                    "“（大）伙”最好要有儿化音。"
                                ]
                            ],
                            "自己唱的话，可以改下词儿。不要唱“老林”，换成其他人。当然也不是随便什么“张三李四”都可以改，要唱着顺口。" +
                            "例如：我们我们（的幸福）……"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "U1",
                                    arranged: "T0",
                                    chords:
                                    [
                                        [
                                            {1: Fadd9, 6: Csus4, 11: G7sus4D, 16: [FWS, C]},
                                            {1: Fsus2, 6: Am7E, 11: G7sus2, 15: [FWS, C]},
                                            {1: F, 5: Dm7A, 8: Gm7D, 14: [FWS, FA]},
                                            {1: bBF, 7: Gsus2D, 11: Csus4, 15: [FWS, F]}
                                        ],
                                        [
                                            {1: FC, 7: Dm, 13: G7sus4, 18: [FWS, C]},
                                            {1: Fsus2, 5: Am7, 9: G7sus2D, 14: [FWS, CG]},
                                            {1: FC, 6: Dm7A, 10: Gm7D, 13: FC},
                                            {1: bBF, 5: Gsus2D, 10: Csus4, 15: [FWS, F]}
                                        ],
                                        [
                                            {1: FC, 6: bB, 10: Dm7A, 14: C},
                                            {1: F, 6: bB, 10: DmA, 14: CG},
                                            {1: FC, 6: bB, 10: Dm7A, 14: C},
                                            {1: F, 6: bB, 10: Am7E, 14: [FWS, F]}
                                        ],
                                        [
                                            {2: AmE, 4: C, 5: [FWS, F]}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "生活的故事从来 不像电影里的片段",
                                "刺激的场面其实 都是家长和里短",
                                "谁说英雄不能 诞生在邻里之间",
                                "守护着日常的生活 也不知道疲倦",
                                "张家的猫咪 李家的狗 它三天两头走散",
                                "小两口子闹别扭 也得好言相劝",
                                "有时候 他抱怨两句在所难免",
                                "但有困难找警察 那绝对不是虚言",
                                "老林老林的幸福 在自己的心里",
                                "老林老林的幸福 是责任在履行",
                                "老林老林的幸福 在大伙的眼里",
                                "老林老林的幸福 是为了老百姓",
                                "是为了老百姓"
                            ]
                        },
                        postscript:
                        [
                            "主歌两段的旋律好像蛮接近的，其实还是有点儿差别的！", LB,
                            "有几处大3、小3都能配，但优先考虑选大和弦。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "前秦比专辑版少了几个小节。", PB,
                                "高潮处的加花很有味道！就这么几个音，但组合得好照样漂亮。", LB,
                                "除了最后一组花音，其余的都比原曲低了8度，否则会和主旋律抢风头？" +
                                "其实最好不降，可以弹轻点儿、或者唱响点儿。", PB,
                                "倒数第2句的主旋律也降了8度，与结束句形成强烈反差，唱起来也会轻松些；" +
                                "原曲都是往高处唱的，朱老师确实功力深厚啊！", PB,
                                "电视原声的尾奏也精简过，但仍不失俏皮色彩。"
                            ]
                        }
                    },
                    MGMGWAN:
                    {
                        h2: "玫瑰玫瑰我爱你",
                        preface:
                        [
                            "据说传到美国、被", [TAG.BoA, "翻唱", "song/us", "RRILY"],
                            "后，美国人说什么也不相信是中国歌铱钢" + EMOJI.SURPRISE, PB,
                            "歌词是这样安排的：把原曲开头的两段拆开，分别放在副歌的前后，主歌各唱1段。", LB,
                            "高潮两段第1和第3句中的俩“心”，起唱点有两种，通过和弦的位置能看出来吧？" +
                            "择其一即可；混合亦可，即第2遍迟半拍再唱。", LB,
                            "两段第2句的最后1个音不同，要注意！通过和弦名也能看出来。第2遍也可以往高音处唱。" +
                            "如果唱高的话，最好停1小节再往下唱，否则显得太急？", LB,
                            "最后加了结束句，和原曲不同。“爱”往高音处唱。", PB,
                            "为了体现出老上海的味道，最好用", [TAG.BoA, "爵士", "song/us", "RRILY"], "风格来演奏！"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "Q0",
                                    arranged: "O0",
                                    chords:
                                    [
                                        [
                                            {1: Cadd9, 3: CE, 5: Dm7, 7: G},
                                            {1: Cadd9, 3: F, 5: Am7G, 7: GD},
                                            {1: Am7E, 3: Am7G, 5: G7D, 7: Em7},
                                            {1: Cadd9, 3: FM7, 5: GD, 7: C}
                                        ],
                                        [
                                            {1: CM7, 3: DmA, 6: Esus4B, 8: CG},
                                            {1: G7D, 4: Cadd9, 6: Am7G, 8: CE},
                                            {0: CM7, 3: DmA, 5: Esus4B, 8: CG},
                                            {1: G7D, 4: Cadd9, 6: Am7G, 8: GD}
                                        ],
                                        [
                                            {1: Cadd9, 3: CE, 5: Dm7, 7: G},
                                            {1: Cadd9, 3: F, 5: Am7G, 7: GD},
                                            {1: Am7E, 3: Am7G, 5: G7D, 7: Em7},
                                            {1: Cadd9, 3: Am, 5: GD, 7: C}
                                        ],
                                        [
                                            {1: Cadd9, 3: F, 5: G, 6: E, 7: C}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "玫瑰玫瑰最娇美",
                                "玫瑰玫瑰最艳丽",
                                "长夏开在枝头上",
                                "玫瑰玫瑰我爱你",
                                "心的誓约 心的情意",
                                "圣洁的光辉照大地",
                                "心的誓约  心的情意",
                                "圣洁的光辉照大地",
                                "玫瑰玫瑰情意重",
                                "玫瑰玫瑰情意浓",
                                "长夏开在荆棘里",
                                "玫瑰玫瑰我爱你",
                                "玫瑰玫瑰我爱你"
                            ]
                        },
                        postscript:
                        [
                            "第3句第4个换成Em也行。之所以加上7音，是因为唱的时候可以在第4句前加个字儿。", LB,
                            "前后两段主歌的第4句及结束句，第2个和弦配得不同，主要是为了求变。都用同一个也行。", LB,
                            "Esus4的效果好像还不错噢？", LB,
                            "结束句中借用了大3和弦E，用小3显得悲伤了。", PB,
                            "以上是按照流行风来编配的；想感受", [TAG.BoA, "爵士", "song/us", "RRILY"],
                            "味儿，请参考", [TAG.BoA, "美版", "song/us", "RRILY"], "。"
                        ],
                        details:
                        {
                            demo: TAG.video, // Ep12 1:22.1~2:2.6
                            comment:
                            [
                                "第2句中的第2个“玫瑰”略带哭腔，唱得很有味道！", LB,
                                "有的版本把“长夏”唱成“春夏”，好像不是很好？"
                            ]
                        }
                    },
                    RYRDYFZQG:
                    {
                        h2: "人与人的缘份真奇怪",
                        preface:
                        [
                            "相关信息很少。有可能是", [TAG.ALP, "台湾歌", "gequ/tw"], "？", PB,
                            "“加油添醋加色彩”里有两个“加”，总觉得用词重复…… 考虑过第2个“加”换成“增”，但唱起来有点儿拗口？" +
                            "也考虑过全用“加”，好像也不好？"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "Q0",
                                    chords:
                                    [
                                        [
                                            {1: D6, 7: Bm7A},
                                            {1: D6, 7: Esus2},
                                            {1: Esus4B, 8: Esus2},
                                            {1: Esus4B, 7: DA}
                                        ],
                                        [
                                            {1: D6, 7: Bm7A},
                                            {1: D6, 7: Esus2},
                                            {1: Esus4B, 8: Esus2},
                                            {1: Esus4B, 8: [FWS, DA], 10: D6sus2, 12: Bmadd11}
                                        ],
                                        [
                                            {3: Dadd9A, 7: BmD},
                                            {3: Bm7Fs, 7: Asus4},
                                            {3: sFm7Cs, 7: Bm7Fs},
                                            {2: GD, 7: Asus4, 9: Asus4E}
                                        ],
                                        [
                                            {3: Dadd9A, 7: BmD},
                                            {3: Bm7Fs, 7: Asus4},
                                            {3: sFm7Cs, 7: Bm7Fs},
                                            {2: Gadd9, 6: A6E, 7: D}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "人与人的缘份真奇怪",
                                "就像狂风暴雨说来就来",
                                "爱情的迷雾总看不明白",
                                "喜怒哀乐费疑猜",
                                "情海浮沉难免受伤害",
                                "上天安排不能说爱就爱",
                                "胡思乱想又何必自怨自艾",
                                "缘份说来自然就会来",
                                "人生的路很精彩",
                                "有人相伴也不坏",
                                "日子淡淡如水你不爱",
                                "加油添醋加色彩",
                                "人群茫茫像大海",
                                "只有你是最可爱",
                                "从此心甘情愿随你摇摆",
                                "就一生一世不分开"
                            ]
                        },
                        postscript:
                        [
                            "主副歌两段的旋律都略有不同，但和弦大多一样。", LB,
                            "……"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "前奏的第1句和主歌的第1句略有不同。", LB,
                                "前奏可当尾奏用。"
                            ]
                        }
                    },
                    RGSCWBYD:
                    {
                        h2: "如果是错我不要对",
                        preface:
                        [
                            "作曲者好像不太出名，几乎查不到资料。", LB,
                            "最大似然估计是", [TAG.ALP, "香港歌", "gequ/xg"], "。", PB,
                            "主歌中有几句好像《圣斗士》？", LB,
                            "“刹（那）”大多数人都念错！"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "y0",
                                    arranged: "v0",
                                    chords:
                                    [
                                        [
                                            {3: Em, 6: EmB, 10: Esus4, 11: [FWS, Bm]},
                                            {0: Bm7, 3: Em, 6: Gadd9D, 10: Bm},
                                            {0: B7, 4: Em7, 9: Am, 13: EmB, 18: [FWS, Esus2]},///B7 right?
                                            {3: GM7, 7: D6A, 12: Em}
                                        ],
                                        [
                                            {0: Bsus4, 4: EmG, 9: BmFs},
                                            {2: Bsus4, 6: [FWS, EmM7]},
                                            {3: AmC},
                                            {1: Gadd9B, 6: BmD}
                                        ],
                                        [
                                            {0: Bsus4, 4: EmG, 9: BmFs},
                                            {2: GM9B, 6: [FWS, Em7]},
                                            {3: CM7},
                                            {1: Am7, 2: D7, 3: GM7, 4: Bsus4Fs, 5: Badd11, 9: EmM7, 10: Em}///Badd11 right?
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "摇动着 不断呐喊的大地",
                                "燃烧起 这刹那的相遇",
                                "还不知道是怎样开始 竟是这样一个结局",
                                "才明白 拥抱的 已成过去",
                                "如果是错 我不要对",
                                "纵然背上千条罪",
                                "你的笑 你的泪",
                                "占据了我……",
                                "如果是错 我不要对",
                                "纵然我一生后悔",
                                "你的爱 你的恨",
                                "煎熬着我  怎去面对"
                            ]
                        },
                        postscript:
                        [
                            "两处Em/B能换成高级点儿的Em11吗？", LB,
                            "两处Em/G不转G也行。"///nonsense,may be deleted
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "为了方便记谱，前奏开头几小节的拍号作了调整。", LB,
                                "尾奏的旋律类似，但有些变化。"
                            ]
                        }
                    },
                    RHSY:
                    {
                        h2: "如花似玉",
                        preface:
                        [
                            "小转音特别多，最高6转！", LB,
                            "……", LB,
                            "倒数第2句加上“啊”，唱起来显得自然些？"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "T0",
                                    chords:
                                    [
                                        [
                                            {1: F, 7: DmA},
                                            {3: G7sus2D, 8: C},
                                            {1: F, 6: Dsus4},
                                            {1: Am7E, 7: Csus4}
                                        ],
                                        [
                                            {1: AmE, 6: D7sus4A},
                                            {1: G7sus2D, 7: DmA},/////
                                            {1: Dm7C, 8: Dsus4},
                                            {1: Am7E, 3: Gm7, 8: [FWS, F], 9: Fsus2}
                                        ],
                                        [
                                            {3: Fadd9, 7: DmF},
                                            {3: Dm7, 7: Asus4},
                                            {3: sFm7Cs, 7: Bm7Fs},
                                            {2: GD, 7: Asus4}
                                        ],
                                        [
                                            {3: Dadd9A, 7: BmD},
                                            {3: Bm7Fs, 7: Asus4},
                                            {3: sFm7Cs, 7: Bm7Fs},
                                            {2: Gadd9, 6: A6E, 7: D}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "每一个如花的女子",
                                "都有似玉般的年华",
                                "为期待中的故事",
                                "拼尽一切的绽放",
                                "每一次 凋落的花事",
                                "应证着流年的落差",
                                "有多少苦涩的结局",
                                "不能再重新接嫁",
                                "我愿如花的女子",
                                "都有似玉般的年华",
                                "前世护花的情郎",
                                "还能相逢在今生的篱下",
                                "我愿如花的女子",
                                "不知流年的落差",
                                "在他房前和屋后啊",
                                "开一朵永不凋落的黄花"
                            ]
                        },
                        postscript:
                        [
                            "……", LB,
                            "……"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "前奏还有待改进！", LB,///
                                "本打算用原曲的间奏来当尾奏用的，但感觉太长了？"
                            ]
                        }
                    },
                    YYCYZ:
                    {
                        h2: "烟雨唱扬州",
                        preface:
                        [
                            "有一句和《新鸳鸯蝴蝶梦》很像" + EMOJI.AWKWARD, PB,
                            "“天”有两种唱法。", LB,
                            "感觉电视原声中的好些，有起伏；专辑里的太平了？"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "Q0",
                                    chords:
                                    [
                                        [
                                            {1: D, 3: A6Cs, 5: Esus2, 7: D},
                                            {1: Bsus4, 5: Em7, 7: A},
                                            {1: D, 3: Esus2, 5: Bm7, 7: sFm7Cs},
                                            {1: E7sus2, 5: Gadd9, 7: D, 8: Dadd9A}
                                        ],
                                        [
                                            {2: D, 4: Bm, 6: sFm, 8: Bm7A},
                                            {3: G, 5: sFm, 7: Em7, 9: Asus2},
                                            {3: Dadd9, 5: sFm, 7: E7sus2, 9: Bm},
                                            {1: E7sus2, 5: Gadd9, 7: D}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "风吹云动天不动",
                                "水推船移岸不移",
                                "刀切莲藕丝不断",
                                "山高水远情不离",
                                "雨绵绵情依依",
                                "多少故事在心里",
                                "五月烟雨濛濛唱扬州",
                                "百年巧合话惊奇"
                            ]
                        },
                        postscript:
                        [
                            "如果欢喜专辑里“天”的唱法，把Esus2改成", [TAG.CHORD, sFm7], "。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "前奏第1句里可以加个高音，也蛮有味道的。", LB,
                                "电视原声没有尾奏；专辑里有，就是把前奏再来一遍。"
                            ]
                        }
                    },
                    YBLE:
                    {
                        h2: "一半脸儿",
                        preface:
                        [
                            "………………有一句和《新鸳鸯蝴蝶梦》很像" + EMOJI.AWKWARD, PB,
                            "“嗡”和“唵”好像都对？", LB,
                            "感觉电视原声中的好些，有起伏；专辑里的太平了？"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "Q0",
                                    chords:
                                    [
                                        [
                                            {1: D, 3: A6Cs, 5: Esus2, 7: D},
                                            {1: E7sus2, 5: Gadd9, 7: D, 8: Dadd9A},
                                            {1: D, 3: A6Cs, 5: Esus2, 7: D},
                                            {1: E7sus2, 5: Gadd9, 7: D, 8: Dadd9A}
                                        ],
                                        [
                                            {1: D, 3: A6Cs, 5: Esus2, 7: D},
                                            {1: E7sus2, 5: Gadd9, 7: D, 8: Dadd9A}
                                        ],
                                        [
                                            {2: D, 4: Bm, 6: sFm, 8: Bm7A},
                                            {1: E7sus2, 5: Gadd9, 7: D}
                                        ],
                                        [
                                            {2: D, 4: Bm, 6: sFm, 8: Bm7A},
                                            {1: E7sus2, 5: Gadd9, 7: D}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "一半脸儿哭 一半脸儿笑",
                                "是哭是笑只有我知道",
                                "一半脸儿阴 一半脸儿阳",
                                "阴阳两全好啊好相貌",
                                "哎…… 哎嗨哎嗨",
                                "哎嗨哎嗨哎",
                                "一半脸儿悲 一半脸儿欢",
                                "悲欢离合人间是常道 是常道",
                                "嗡嘛呢叭咪吽 唵嘛呢叭咪吽",
                                "吽啊吽 吽啊吽 吽啊吽吽吽"
                            ]
                        },
                        postscript:
                        [
                            "如果欢喜专辑里“天”的唱法，把Esus2改成", [TAG.CHORD, sFm7], "。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "前奏第1句里可以加个高音，也蛮有味道的。", LB,
                                "电视原声没有尾奏；专辑里有，就是把前奏再来一遍。"
                            ]
                        }
                    },
                    YAtM:
                    {
                        cover: "en",
                        h2: "You Are the Miracle",
                        preface:
                        [
                            "With 100 days to go before the Beijing 2022 Winter Olympics, " +
                            "the first English song for the Olympics was released, " +
                            "which is the cover of a pleasant Chinese song - ",
                            [TAG.q, "你笑起来真好看 / You Look Nice When Smiling"], DOT
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "R2",
                                    arranged: "O0",
                                    chords:
                                    [
                                        [
                                            {1: C, 20: G},
                                            {1: Csus2, 18: CE},
                                            {1: Am, 20: Em7G},
                                            {1: Dm7A, 16: GD}
                                        ],
                                        [
                                            {1: C, 17: Gsus4},
                                            {1: AmE, 19: Em7G},
                                            {1: F, 17: Em7G},
                                            {1: Dm7A, 9: F, 20: CG}
                                        ],
                                        [
                                            {1: C, 15: Gsus4D},
                                            {8: Am, 26: CG},
                                            {5: Fadd9, 18: Em7G},
                                            {1: Asus4, 18: GD}
                                        ],
                                        [
                                            {1: C, 15: Gsus4D},
                                            {3: Am7, 18: G},
                                            {1: Fadd9, 26: Em7G},
                                            {1: Asus4, 13: Gsus4D, 17: C}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "Cross the mountain  cross the sea",
                                "Winter Games are in Beijing",
                                "Gather 'round with all your friends",
                                "Join us in the snow",
                                "Work your magic on the slope",
                                "Having fun in the shining rink",
                                "Hear the voices in your heart",
                                "Time to claim your crown",
                                "Welcome to Beijing",
                                "We're about to give it a go",
                                "The Olympics are magical",
                                "Passion's set to grow",
                                "Welcome to Beijing",
                                "Together  we will glow",
                                "Share your smiles in the winter world",
                                "You are the miracle"
                            ]
                        },
                        postscript:
                        [
                            "Some of the chords in the 1st verse are distinguished " +
                            "from those in the 2nd one (same as the 1st and 2nd chorus) " +
                            "because the melodies are a bit different."
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "The demo was arranged on the basis of the Chinese version.", LB,
                                "The interlude of the original, into which several chords had been inserted, " +
                                "was played as the outro."
                            ]
                        }
                    },
                    YBWFWTX:
                    {
                        h2: "与百万富翁同行",
                        preface:
                        [
                            "歌词有两套！这里选的是第6集片头的词儿，其它集都是另一套版本。说下几处不同：", LB,
                            [
                                TAG.ul,
                                [
                                    "第1句的俩叠词：平平常常、普普通通",
                                    "副歌的第2句：紧抓住那机遇，成竹在胸",
                                    "结束句的最后1个成语：美如彩虹"
                                ]
                            ]
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "t0",
                                    chords:
                                    [
                                        [
                                            {1: DmA, 10: Dm7F, 14: DmA},
                                            {1: GmD, 11: C, 15: AmE},
                                            {1: DmA, 5: Dm7F, 9: AmC, 12: AmE},
                                            {1: DmA, 5: Gsus2, 10: Dm, 13: DmA}
                                        ],
                                        [
                                            {1: Gm7D, 5: [FWS, Gm], 7: AmE, 11: [FWS, Am]},
                                            {1: AmC, 5: bBF, 10: Asus4, 12: [FWS, C]}
                                        ],
                                        [
                                            {1: bB, 5: bBF, 8: G7sus4D, 11: [FWS, Am]},
                                            {1: AmC, 5: Gm7D, 8: FC, 10: [FWS, Dm]}
                                        ],
                                        [
                                            {1: AmC, 6: Dm7},
                                            {1: Em7b5G, 3: Em7b5, 6: Csus2, 8: DmA}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "别看今天普普通通 贫贫穷穷",
                                "说不定明朝腰缠万贯 变成富翁",
                                "人生之旅有晴有雨又有风",
                                "大海弄潮靠的是有智又有勇",
                                "玩的是心跳 试的是身手",
                                "白天黑夜苦苦寻觅的是成功",
                                "走遍天涯海角 来去匆匆",
                                "一心一意去圆 黄金梦",
                                "凭真本事做大买卖",
                                "事业发达 财运亨通"
                            ]
                        },
                        postscript:
                        [
                            "如果欢喜专辑里“天”的唱法，把Esus2改成", [TAG.CHORD, sFm7], "。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "前奏第1句里可以加个高音，也蛮有味道的。", LB,
                                "电视原声没有尾奏；专辑里有，就是把前奏再来一遍。"
                            ]
                        }
                    },
                    ZMNZML:
                    {
                        h2: "怎么你怎么了",
                        preface:
                        [
                            "本以为原唱有几处咬字不清，闹了半天是某些网站和视频提供的词儿不对！" +
                            "否则数姊々错得也太低级了吧" + EMOJI.CANNOT,
                            [
                                TAG.ul,
                                [
                                    "任性：担心",
                                    "只：却",
                                    "掩饰：迷失",
                                    "影子：名字"
                                ]
                            ],
                            "电视剧片尾字幕看不太清楚。", PB,
                            "完整版的第2遍中，主、副歌之间加了1个小节。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "S0",
                                    arranged: "Q0",
                                    chords:
                                    [
                                        [
                                            {3: DM7A, 9: sFmCs},
                                            {4: DM7Fs, 9: A6sus2},
                                            {2: sFm7Cs, 8: Em7B},
                                            {4: G, 11: A6E}
                                        ],
                                        [
                                            {3: DM7A, 8: [DFWS, sFmCs]},
                                            {3: DM7A, 8: Esus2},
                                            {2: sFm7Cs, 6: Em7B},
                                            {3: G, 11: A, 12: Asus4E}
                                        ],
                                        [
                                            {3: DA, 5: ACs, 9: Esus2B, 14: D6A},
                                            {3: D6Fs, 7: G, 13: A, 14: Asus4E},
                                            {3: DA, 6: [DFWS, ACs], 10: Esus2B, 12: D6A},
                                            {4: D6Fs, 9: G, 12: [FWS, D]}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "总以为 你就在那里",
                                "忘了时间 川流不息",
                                "我用任性 留你在身边",
                                "却还是忘了 你模糊的脸",
                                "颠覆了 我们的从前",
                                "粉碎了 将来那一天",
                                "我只剩下 勇气在身边",
                                "用尽了力气 却还在思念",
                                "无论夜再黑 掩饰不了发霉的纪念",
                                "想忘记 你影子 却挥之不去",
                                "怎么你怎么了 我又怎么了",
                                "那些美好 怎么就变成昨天"
                            ]
                        },
                        postscript: "Em7/B换成E7sus2也行。",
                        details:
                        {
                            demo: TAG.audio,
                            comment: "前奏可当尾奏用，示范中简化了。"
                        }
                    }
                }
            },
            xg:
            {
                nav: "香港",
                header: {h1: "香港歌"},
                main:
                {
                    XAWM:
                    {
                        h2: "相爱无梦",
                        preface:
                        [
                            "歌名到底是偏喜还是偏悲？无梦，作何解？",
                            [
                                TAG.ul,
                                [
                                    "不是梦（喜）",
                                    "别梦想（悲）"
                                ]
                            ],
                            "看歌词和听旋律呢，那就是悲了。", PB,
                            "完整版中最后一遍高潮升半音。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "Q0",
                                    chords:
                                    [
                                        [
                                            {3: D, 8: sFm7},
                                            {3: Bm, 8: Asus4},
                                            {4: DM7Fs, 11: D},
                                            {3: Asus2, 8: A7E}
                                        ],
                                        [
                                            {3: D, 9: sFm7},
                                            {3: Bm, 9: Asus4},
                                            {4: DM7, 11: D6A, 18: Gadd9D},
                                            {5: AE, 7: A6sus4}
                                        ],
                                        [
                                            {3: Dadd9, 8: A6},
                                            {3: Bm, 9: ACs},
                                            {3: Gadd9, 9: D},
                                            {3: Asus4, 8: [DFWS, AE], 10: A6sus4}
                                        ],
                                        [
                                            {3: Dadd9, 8: A6E},
                                            {3: Bm, 9: ACs},
                                            {3: Gadd9, 8: Dadd9A, 12: Em7},
                                            {3: A, 6: Dsus2}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "跟你抱着 未等于爱上",
                                "不再抱着 未等于不想",
                                "你我在这分钟 说过无缘再见",
                                "下秒钟再凑巧碰上",
                                "即使一起 貌合却又神离",
                                "分隔两地 日夜挂着愁眉",
                                "再各自结新欢 却暗地拿你去比较现有的",
                                "始终偏袒你",
                                "有心爱你却爱不到",
                                "抱紧了你却又未想终老",
                                "再等到与对方失散以后",
                                "就会知原来谁最好",
                                "爱不到至会更想爱",
                                "抱紧了你我又无心装载",
                                "我跟你也破不到男与女之间",
                                "爱情的 定数"
                            ]
                        },
                        postscript:
                        [
                            "主、副歌都有两段。前两句旋律几乎相同，和弦也几乎相同；后两句差别较大，和弦也有几个不一样。", LB,
                            "如果不弹尾奏，用D来结束也行。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "前奏的最后和尾奏的最初都有重复的小节，各保留1个。", LB,
                                "前、尾奏的这俩小节，乍一听似乎相同的？其实不一样。"
                            ]
                        }
                    },
                    ADWN:
                    {
                        h2: "爱的温暖",
                        preface:
                        [
                            "据说和《香港料理》雷同……", LB,
                            "是有点儿像！可能是参考了前作？但改得不错啊！", PB,
                            "如果感觉高潮有点儿难唱，那可能是换气做得不好？", LB,
                            "较为合理的时机大概是第1、3和4行的末尾；2、3行连得比较紧，几乎没有间隙换气。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "O0",
                                    chords:
                                    [
                                        [
                                            {1: CE, 3: CG, 6: Am7, 8: Am7G},
                                            {1: Dsus2, 3: Cadd9E, 6: Dm7, 9: G},
                                            {1: CE, 3: CG, 6: Am7, 8: Am7G},
                                            {2: Dsus2, 5: Gsus2, 7: C}
                                        ],
                                        [
                                            {1: CE, 3: CG, 6: Am7, 8: Am7G},
                                            {1: Dsus2, 3: Cadd9E, 6: Dm7, 9: G},
                                            {1: CE, 3: CG, 6: Am7, 8: Am7G},
                                            {2: D7sus2, 6: Gsus4, 8: GD, 9: G7}
                                        ],
                                        [
                                            {3: C, 5: Am7, 9: Cadd9, 11: CE},
                                            {1: D7sus2, 5: Am, 8: D7sus2, 12: Gsus2},
                                            {3: C, 5: Am7, 9: Cadd9, 11: CE},
                                            {1: D7sus2, 5: F, 7: GD, 8: G7}
                                        ],
                                        [
                                            {3: C, 5: Am7, 9: Cadd9, 11: CE},
                                            {1: D7sus2, 5: Am, 8: D7sus2, 12: Gsus2},
                                            {3: C, 5: Am7, 9: Cadd9, 11: CE},
                                            {1: D7sus2, 5: Fadd9, 7: C}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "在外要 扮演着你",
                                "进了家 不需再力疲",
                                "或外界 误解着你",
                                "家里也必体谅你",
                                "附和你 未需道理",
                                "对你好 可体贴入微",
                                "佑护你 在屋檐里",
                                "倦疲 仍然能报喜",
                                "同住我与你 同度跌与起",
                                "要捉紧快乐 不要天天皱眉",
                                "同路我与你 无论乐与悲",
                                "满天风雨亦撑起",
                                "如像老友记 同度跌与起",
                                "顷刻的压力 总有一天远离",
                                "同路我与你 无论乐与悲",
                                "爱的温暖别忘记"
                            ]
                        },
                        postscript:
                        [
                            "本打算尽可能每小节只放一和弦，某些小节除外。结果“某些”小节有点儿多，干脆全放俩吧。", LB,
                            "反正蛮欢快的，变化多听起来也不错。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "原曲的前奏和副歌一模一样！是赶工还是咋的" + EMOJI.SURPRISE, LB,
                                "幸好间奏有点儿变化。为了避免重复，把原曲的间奏拿来当前奏用。", PB,
                                "最后可以加个结束句，就像《", [TAG.BoA, "爱不释手", "gequ/tw", "todo"], "》那样。"///ABSS
                            ]
                        }
                    },
                    DGASM:
                    {
                        h2: "当狗爱上猫",
                        preface:
                        [
                            "歌名蛮有趣儿的" + EMOJI.HAPPY, PB,
                            "两处“犹（如）”的持续时间不同！前者匀速唱；后者要短些，快点儿把后面的带出来。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "W2",
                                    arranged: "V0",
                                    chords:
                                    [
                                        [
                                            {3: G, 11: GM7D},
                                            {3: G, 11: D},
                                            {3: C, 10: [FWS, G]},
                                            {2: CM7E, 6: [FWS, DA]}
                                        ],
                                        [
                                            {3: G, 11: GM7D},
                                            {3: G, 11: D},
                                            {3: C},
                                            {2: [FWS, G], 7: C, 10: [FWS, DA]}
                                        ],
                                        [
                                            {3: GM7B, 11: GM7},
                                            {3: GM7B, 11: Gadd9},
                                            {3: GM7B, 11: CM7, 17: Am7E},
                                            {0: Cadd9, 4: DA, 6: D7sus4}
                                        ],
                                        [
                                            {4: Gsus2, 9: Dsus4},
                                            {4: Gsus4, 7: [FWS, G7D]},
                                            {3: Cadd9, 9: Gsus4},
                                            {1: CM7b5E, 6: Dsus4}
                                        ],
                                        [
                                            {4: Gsus2, 9: [FWS, Dsus4A]},
                                            {4: Gsus4D, 7: [FWS, D7sus4A]},
                                            {3: G, 7: Em, 11: Bm},
                                            {2: CM7, 6: [FWS, Am], 8: Dadd11, 10: [FWS, G]}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "孤单的猫多坎坷 离群沉醉自我",
                                "他跟她的不管多 无情常太自我",
                                "一向挑剔声音多 傻傻的猫科",
                                "像每事觉得不妥",
                                "忠心小狗拖一拖 完全违背自我",
                                "身边通通管得多 常常重复犯错",
                                "仿似初恋的初哥",
                                "热心带着傻傻气 的一个",
                                "你是你 我是我 两样性情没错",
                                "你或我 各自各 发现对方经过",
                                "爱着你 爱着我 纵是来自极端的结果",
                                "仍然爱我",
                                "情寻对偶 犹如小狗",
                                "诚意全奉上的温柔",
                                "时常是我好友 爱觅到因由",
                                "甜蜜 牵牵手",
                                "情寻对偶 犹如小丑",
                                "常带来玩笑都不够",
                                "无论逝去的 现有的 还幸有",
                                "甜蜜幸福声音 我独有"
                            ]
                        },
                        postscript:
                        [
                            "G7的效果好像还不错噢？", LB,
                            "大7减5好像不咋地？"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "前奏还凑合？", LB,
                                "过渡段和尾奏蛮难编的。"
                            ]
                        }
                    },
                    FFZ:
                    {
                        h2: "放风筝",
                        preface:
                        [
                            "歌名是即兴取的。", PB,
                            "网上只找到一个相关",
                            [TAG.a, "页面", "https://zhidao.baidu.com/question/651740046295640485.html"],
                            "，歌词也是从那儿抄来的。", LB,
                            "缺少的词儿由", [TAG.J2C, "粤语指导老师"], "补全" + EMOJI.HAPPY
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "V0",
                                    chords:
                                    [
                                        [
                                            {1: G, 5: GD},
                                            {1: Gadd9, 6: D6},
                                            {1: Am, 6: C},
                                            {1: Asus2, 4: Dsus2, 6: G}
                                        ],
                                        [
                                            {1: GD, 5: G},
                                            {1: Gadd9, 6: D6},
                                            {1: Am, 6: C},
                                            {1: Asus2, 4: Dsus2, 6: G}
                                        ],
                                        [
                                            {1: GB, 5: Asus2},
                                            {1: GM7, 6: EmFs},
                                            {1: AmC, 5: Gadd9B},
                                            {1: A7sus2, 5: D}
                                        ],
                                        [
                                            {1: G, 5: GD},
                                            {1: Gadd9, 6: D6},
                                            {1: Am, 6: C},
                                            {1: Asus2, 4: Dsus2, 6: G}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "结伴去 放风筝儿",
                                "似风筝真正很自由",
                                "用双手 怀抱日后",
                                "说笑声齐合奏",
                                "你共我 永不忧愁",
                                "似风筝天际快乐游",
                                "用真心 齐向上望",
                                "哪怕艰难没有",
                                "飞飞飞 好欢喜",
                                "这世界是个乐园地",
                                "有你和我天天嬉戏",
                                "好玩到飞起",
                                "你共我 永不忧愁",
                                "似风筝天际快乐游",
                                "愿彼此 承美梦在",
                                "永远心灵活透"
                            ]
                        },
                        postscript:
                        [
                            "主歌第2句可以改点儿旋律？那就把D6换成D。", LB,
                            "不过作曲者就是要避开大家首先想到的旋律？"
                        ],
                        details:
                        {
                            demo: TAG.video, // Ep.5 11:56.4 ~ 12:54
                            comment:
                            [
                                "边拉边唱，这也可以？", PB,
                                "第2段第4句乍一听，以为是“哪怕有男朋友”" + EMOJI.AWKWARD, LB,
                                "幸好有", [TAG.J2C, "粤语指导老师"], "的纠正。"
                            ]
                        }
                    },
                    JZHQ:
                    {
                        h2: "君子好逑",
                        preface:
                        [
                            "由《四大才子》及其配偶的8位扮演者一起唱的，阵容强大！", PB,
                            "说下俩版本的差异：",
                            [
                                TAG.ul,
                                [
                                    [
                                        "电视原声",
                                        [
                                            TAG.ul,
                                            [
                                                "第3句由魏、林2人合唱；",
                                                "女声第2个演唱的是虹姐，伶姐唱第4句。"
                                            ]
                                        ]
                                    ],
                                    [
                                        "专辑",
                                        [
                                            TAG.ul,
                                            [
                                                "第1段中魏、林分别唱前、后半句；",
                                                "女声2、4句的演唱者则和上面相反。"
                                            ]
                                        ]
                                    ]
                                ]
                            ],
                            "另外，男声合唱和女声合唱的部分也有些不同，就不再详述了。", PB,
                            "“美貌与智力也不重要”唱得很有味道" + EMOJI.LOVE, LB,
                            "也欢喜“然后世间优美动人”这句，旋律与歌词都很好。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "U1",
                                    arranged: "T0",
                                    chords:
                                    [
                                        [
                                            {3: DmF, 11: Dm7, 15: [FWS, C]},
                                            {3: Fadd9A, 7: bB, 11: Fadd9A, 15: Csus2},
                                            {3: DmF, 12: Dm7, 16: [FWS, C]},
                                            {3: Fadd9A, 7: bB, 12: DmA, 16: CG, 17: C7}
                                        ],
                                        [
                                            {3: Dm, 8: [FWS, Am]},
                                            {3: bBM7, 10: CG, 11: C7}
                                        ],
                                        [
                                            {0: Fadd9, 8: Dm7C},
                                            {0: Fadd9, 9: Dm7C},
                                            {0: Fadd9, 8: Dm7C},
                                            {1: G7sus2, 5: [FWS, Am], 10: Fadd9, 14: bBadd9, 17: F}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "无论书读多少与这一秒都再没紧要",
                                "看到她的一笑会令壮丁都显得渺小",
                                "文学意念再妙也没给我 这震荡心跳",
                                "爱恋真不可以意料 我的心跳上云霄",
                                "美貌与智力也不重要",
                                "情共爱 我问你可知晓",
                                "天之骄子一个人  从没快乐开心",
                                "欢喜冤家一贴身 然后世间优美动人",
                                "必须找到真爱心  期望托付终生",
                                "想到天昏地暗 流浪半生终于也被情困"
                            ]
                        },
                        postscript: "主歌基本是1小节俩和弦；后面大都是每小节1个。",
                        details:
                        {
                            demo: TAG.audio,
                            comment: "尾奏只弹1段也行。"
                        }
                    },
                    RLJS:
                    {
                        h2: "燃亮今生",
                        preface:
                        [
                            "好歌没有被专辑收录，可惜啊！而且只唱一遍，短了点儿。", PB,
                            "找了几处的歌词，都有些差异，简单分析下……",
                            [
                                TAG.ul,
                                [
                                    "遭／祝：读音有点儿像，但前者表转折，更贴切；",
                                    "航／行：读音相同，意思也都通。但提到风雨，可能是在海上？",
                                    "患难／还梦：错得有点儿离谱；",
                                    "惟／唯：俩词儿互通，难以抉择。"
                                ]
                            ],
                            "还是以权威发布的为准！", PB,
                            "结束句男女一起唱，但旋律不同。要注意！"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "T0",
                                    chords:
                                    [
                                        [
                                            {3: Fadd9, 13: CG},
                                            {3: Dm, 7: [FWS, Gm7], 10: Gm6, 12: C},
                                            {2: bB, 10: F, 12: Am7E, 14: [FWS, Dm]},
                                            {3: bB, 7: F, 9: Fadd9, 11: [FWS, Am7E], 13: Gm7, 14: C, 15: bB, 16: C}
                                        ],
                                        [
                                            {0: [F, FWS, FM7], 3: bB, 8: bBadd9D, 13: Dm7C, 17: [FWS, FA], 19: FM7, 20: F},
                                            {3: bB, 8: D7sus2, 12: [FWS, FC], 14: bB, 15: C},
                                            {3: bB, 8: bBadd9D, 13: C, 15: Am7E, 17: [FWS, Fadd9A]},
                                            {2: bBM7F, 9: C7G, 13: F}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "同来发放友爱火光 遭风雨一样愿同航",
                                "明白爱里永有希冀 眼内藏",
                                "患难里与你奔往 来编织关心网",
                                "去慰问 无尽痛苦的眼光",
                                "惟求一点烛光 一点温暖 化作了希望",
                                "惟求点起孤单 漆黑的曙光",
                                "惟求一起高歌 一起相信 爱里有未来",
                                "仍是热爱 我愿被爱 找到方向"
                            ]
                        },
                        postscript:
                        [
                            "Gm7似乎不太好？Gm6还不错？", PB,
                            "两个《套餐》蛮有味道的噢？",
                            [
                                TAG.ul,
                                [
                                    "F" + ARROW + "Am7/E" + ARROW + "Dm",
                                    "Am7/E" + ARROW + "Gm7" + ARROW + "C"
                                ]
                            ]
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "前奏很优美！剧中一播放，就被其吸引" + EMOJI.HAPPY, LB,
                                "这么多年过去了，终于有能力将它还原出来，很欣慰！", LB,
                                "以前有过两段的版本，拼接得不错！而今想要扩展成完整版，应该也不会很难。"
                            ]
                        }
                    },
                    TDHQ:
                    {
                        h2: "天地豪情",
                        preface:
                        [
                            "不是香港时装剧，而是武打片《南拳北腿》的主题歌。但其实是",
                            [TAG.ALP, "马来西亚", "gequ/mlxy"], "歌。", PB,
                            "主歌第1段第4句和第2段第1句里都有“长”，离得太近！所以把后一个改成“在”。", LB,
                            "主歌两段的最后1句，比其它小节要少一半。", LB,
                            "《专辑》里最后一遍副歌中，两段第1句的歌词和旋律都有变化。" +
                            "第1段的“天地是太多苦困”好像不通？把“是”改成“有”？这里第2段用的是变化后的词儿。", LB,
                            "别的网站都是“（进退我）会（觅寻）”，但好像唱的是“去”？又去看了电视剧的片头求证……", LB,
                            "最后一句蛮有味道的" + EMOJI.SMILE
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "V0",
                                    chords:
                                    [
                                        [
                                            {0: G, 4: GD},
                                            {4: A7sus2},
                                            {4: Em7},
                                            {4: A7sus2, 9: Cadd9, 10: [FWS, D]}
                                        ],
                                        [
                                            {4: G},
                                            {4: A7sus2},
                                            {4: Em7},
                                            {4: A7sus2, 11: Cadd9, 12: [FWS, D], 13: D7}
                                        ],
                                        [
                                            {1: GM7, 5: [FWS, BmFs]},
                                            {1: C, 10: Dsus4},
                                            {1: CM7, 5: [FWS, Bm]},
                                            {1: A7sus2E, 8: Dsus2A}
                                        ],
                                        [
                                            {1: G, 5: [FWS, Dadd9A]},
                                            {1: C, 10: Dsus4},
                                            {1: CM7, 5: [FWS, Gadd9B]},
                                            {1: Asus2E, 6: D6sus4A, 10: [FWS, G]}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "豪情踏彩云",
                                "跨山与水向那苍天发问",
                                "埋藏着每寸心里怒愤",
                                "怎可强忍 朗日长黑暗",
                                "在流浪的人",
                                "高声震天发泄心中怨恨",
                                "情和义永远碧血内渗",
                                "匆匆这生 唯求世上存公允",
                                "天地是一生重任",
                                "奔奔波波兜兜转转 我与我再独行",
                                "生命内几许浮沉",
                                "我以气概世上留一对足印",
                                "当夜静叹息不禁",
                                "多多少少得得失失 进退我去觅寻",
                                "怎形容孤单一个",
                                "却有你的爱  最深刻记印"
                            ]
                        },
                        postscript:
                        [
                            "如果小节长度想和原曲定得一样，主歌第1段最后的D少弹两拍；第2段的D或D7只要1个，或者各弹一半。", PB,
                            "副歌的两种旋律，使得和弦也不一样。上面把前后两套都列出来了。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "为了方便记谱，把小节长度作了统一。", LB,
                                "副歌两段第1句的两种变化放在一起分前后两段表现出来，与原曲不同。"
                            ]
                        }
                    },
                    XHSJ:
                    {
                        h2: "雪花神剑",
                        preface:
                        [
                            [TAG.J2C, "粤语指导老师"], "大力推荐" + EMOJI.HAPPY, LB,
                            "起初不以为然，听过一次后就上瘾了！", PB,
                            "歌名应该是叫《爱不了忘不了》，但名儿和歌词好像不搭？倒是国语版的词儿与歌名很配。" +
                            "所以在此把粤语版的改成与电视剧同名。", LB,
                            "粤语版的女声是大陆歌手唱的；国语版反倒是香港歌手" + EMOJI.SURPRISE, PB,
                            "过渡段音突然升高，高潮更是到了极点！后面跳过1段，直接进入结束句。", LB,
                            "最高音一般人真的唱不上去噢？麦老师的唱功确实了得啊；据说王老师也是得过歌唱比赛冠军的！"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "W2",
                                    arranged: "V0",
                                    chords:
                                    [
                                        [
                                            {4: G, 10: Em7B},
                                            {1: A7sus4, 7: [FWS, D]},
                                            {4: G, 10: Em7B},
                                            {1: A7sus2, 7: [FWS, DA], 8: D7}
                                        ],
                                        [
                                            {2: [FWS, Bm7], 7: Em},
                                            {2: A7sus4, 9: Bm7},
                                            {3: Am7, 7: Em},
                                            {3: Asus4, 9: [FWS, D]}
                                        ],
                                        [
                                            {3: Gadd9, 7: Em},
                                            {3: Cadd9, 10: [FWS, Asus2]},
                                            {3: GM7B, 6: [FWS, C]},
                                            {2: Am7, 9: [FWS, D], 11: D7}
                                        ],
                                        [
                                            {4: G, 10: Em7B},
                                            {1: A7sus2, 5: D7sus2, 7: G, 8: G}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "剑锋划破一地雪 留寒梅滴血",
                                "书写恩怨千万年",
                                "雪花在半空上转 仍然难避免",
                                "爱可粉碎于面前",
                                "转身走 走不远",
                                "雪花满天忘情我不愿",
                                "你不必 再挂念",
                                "别时容易再会应在何年",
                                "风霜约 烟花扣",
                                "可以为这段情逗留多久",
                                "风雨中 爱过后",
                                "我最是明白往日已拥有",
                                "剑招或有千万变 仍然难自断",
                                "千秋泣血的恨怨"
                            ]
                        },
                        postscript:
                        [
                            "第1段落结束用的D7弹两下也行，这样就要额外加2拍；也可以不要D/A，D7弹两下，就像原曲那样。", LB,
                            "Asus2和", [TAG.CHORD, GM7B], "有点儿怪吧？听多了反倒觉得效果很好" + EMOJI.AWKWARD
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "“风霜约”一般人还真的唱不了？实在上不去，可以低8度唱；", LB,
                                "但“爱过后”不能降，用假声也得吊上去，否则不好听！", PB,
                                "男女对唱，整得分不清谁高谁低，究竟在哪个8度？"
                            ]
                        }
                    }
                }
            },
            tw:
            {
                nav: "台湾",
                header: {h1: "台湾歌"},
                main:
                {
                    QRCDFFF:
                    {
                        h2: "俏如彩蝶飞飞飞",
                        preface:
                        [
                            "词儿写得不错！最欢喜“怎么我也没想到，爱已悄悄入心扉”这句。", LB,
                            "“尽管”好像有点儿别扭？改成“总是”？"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "Y2",
                                    arranged: "V0",
                                    chords:
                                    [
                                        [
                                            {1: Gadd9D, 5: G},
                                            {1: Em7B, 5: Dsus4},
                                            {1: C, 5: Bm},
                                            {1: A7sus2E, 6: [FWS, DA], 8: D7Fs}
                                        ],
                                        [
                                            {1: Gadd9D, 5: G},
                                            {1: Em7B, 5: Dsus4},
                                            {1: C, 5: Bm},
                                            {1: Asus2E, 3: D6, 7: [FWS, GB], 9: G7}
                                        ],
                                        [
                                            {2: BmFs, 5: [FWS, DA]},
                                            {2: EmG, 5: [FWS, C]},
                                            {1: Esus2B, 3: C},
                                            {1: sFm7b5A, 7: [FWS, D], 9: D7A}
                                        ],
                                        [
                                            {1: Gadd9D, 5: G},
                                            {1: Em7B, 5: Dsus4},
                                            {1: Em, 5: Bm},
                                            {1: Asus4E, 5: C, 7: G}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "你不知道我是谁",
                                "我不知道你是谁",
                                "偶然我们巧相逢",
                                "却有一点小误会",
                                "因为友情真可贵",
                                "我们谁也不怪谁",
                                "怎么我也没想到",
                                "爱已悄悄入心扉",
                                "情话一箩筐",
                                "情书一大叠",
                                "不说也不寄",
                                "谁也没有告诉谁",
                                "爱像春风吹呀吹",
                                "俏如彩蝶飞呀飞",
                                "不要尽管笑呀笑",
                                "为何不来追呀追"
                            ]
                        },
                        postscript:
                        [
                            "副歌蛮难配的。尝试了半减，效果好像还不错噢？", PB,
                            "最后一遍主歌的第3句，旋律和前两遍都一样，但第1个和弦选得不同。", LB,
                            "其实这俩都可以。因为结束句中有C，所以上一句就换一个。", PB,
                            "最后1句第1个换成Csus2或G7sus4也行。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment: "点题句用的是原曲第2遍中的旋律。和第1遍相比，前半句里有小转音。"
                        }
                    },
                    CF:
                    {
                        h2: "春风",
                        preface:
                        [
                            "因为完全是按照“陈天贵”的弹唱来记谱的，所以选用了F调。", LB,
                            "如果觉得有难度，可以降回原调；或者升至G调，不过前提是能再唱高1个音！"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "Q0",
                                    arranged: "T0",
                                    chords:
                                    [
                                        [
                                            {2: F, 6: [FWS, Am], 7: [FWS, A7], 10: Gm, 14: [FWS, Dm]},
                                            {2: F, 6: [FWS, Am], 7: [FWS, A7], 10: Gm, 12: C7, 15: F},
                                            {3: bB, 8: F, 10: C7, 14: bB, 19: F, 21: C},
                                            {3: F, 7: [FWS, Am], 8: [FWS, A7], 11: Gm, 13: C7, 16: F, 17: bB, 18: C, 19: F}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "春风快加紧脚步 快到我窗前漫舞",
                                "春风请穿过门缝 请在我脸上轻吻",
                                "越过那千层的山峰…… 带给我亲切的问候……",
                                "今年我们又再相逢 请给我新的祝福"
                            ]
                        },
                        postscript:
                        [
                            "主要就是F调常用的几个和弦，很好记。", LB,
                            "基本上是每个和弦弹两遍。有几处例外，要拆成俩。"
                        ],
                        details:
                        {
                            demo: TAG.video, // Ep19 4:31.2~5:15
                            comment:
                            [
                                "澎老师唱得真好啊，琴弹得更好！", LB,
                                "大拇指扫弦？这个手法没看懂" + EMOJI.SURPRISE, PB,
                                "F和", [TAG.CHORD, bB], "还是用大横按比较好。指力强劲的网友，如果能用双横按来弹",
                                [TAG.CHORD, bB], "，那当然最好！", LB,
                                "高潮中的C7似乎不是很好？而且换弦也不太方便。不如把前一个F再弹一次？", LB,
                                "尾奏中的C最好也大横按，这样换弦方便些。"
                            ]
                        }
                    },
                    GNM:
                    {
                        h2: "给你们",
                        preface:
                        [
                            "和张老师其它的名曲相比，这歌的传唱度就比较低了。但可以算得上是他们夫妻俩具有代表性的经典曲目！", LB,
                            "据说许多婚礼上都唱这歌，确实很合适" + EMOJI.HAPPY, PB,
                            "照理说11老师是有名的作词家，不应该质疑她写的东西。可总感觉“别人”有点儿怪？指谁啊？岳父、岳母？" +
                            "整句唱起来还算顺口，但听着好像是不相干的人？当然也不能用“岳父／母”来替换，这太别扭了。", LB,
                            "改成“她把自己全都托付在你手上”？"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "W2",
                                    arranged: "V0",
                                    chords:
                                    [
                                        [
                                            {6: [FWS, Gsus2]},
                                            {0: A7sus2, 7: D6sus4, 12: EmG},
                                            {7: A7sus2E, 12: Asus4},
                                            {7: [FWS, GB]}
                                        ],
                                        [
                                            {6: [FWS, Gsus2]},
                                            {0: A7sus2, 7: D6sus4, 12: EmG},
                                            {7: A7sus2E, 12: Asus4},
                                            {4: Bm7Fs, 7: GD, 8: G7}
                                        ],
                                        [
                                            {7: [FWS, G6]},
                                            {0: C, 8: DA, 11: Bm7Fs, 13: [FWS, GB]},
                                            {6: Gadd9D, 13: Bm7Fs},
                                            {5: [FWS, Dsus4]}
                                        ],
                                        [
                                            {0: GM9B, 4: Am7, 7: [FWS, G6]},
                                            {0: C, 8: DA, 11: Bm7Fs, 13: [FWS, GB]},
                                            {5: [FWS, Am7E]},
                                            {0: Bm7, 4: Dsus2, 6: [FWS, G], 8: G6}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "他将是你的新郎",
                                "从今以后他就是你一生的伴",
                                "他的一切都将和你紧密相关",
                                "福和祸都要同当",
                                "她将是你的新娘",
                                "她是别人用心托付在你手上",
                                "你要用你一生加倍照顾对待",
                                "苦或喜都要同享",
                                "一定是特别的缘份",
                                "才可以一路走来变成了一家人",
                                "他多爱你几分 你多还他几分",
                                "找幸福的可能",
                                "从此不再是一个人",
                                "要处处时时想着念的都是我们",
                                "你付出了几分",
                                "爱就圆满了几分"
                            ]
                        },
                        postscript:
                        [
                            "每个段落的第1句，基本上都是清唱。", PB,
                            "高潮第1段的后2句中，有3个小节旋律几乎是一样的，但和弦要有变化才够味儿。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "前奏中旋律雷同的小节就省略了。", LB,
                                "前奏可当尾奏用。"
                            ]
                        }
                    },
                    LDXYQ:
                    {
                        h2: "绿岛小夜曲",
                        preface:
                        [
                            "虽然整首歌用的都是中国传统五声音阶，但是听起来曲风有点儿特别？", PB,
                            "这是首情歌，女歌手如果也唱“姑娘”，不太恰当噢？" +
                            "与之对应的词儿呢，首先想到的肯定是“小伙”？但这样唱好像老憨娥噢！", LB,
                            "听纪老师说：“姑娘”唱成“情郎”。改得完美！甄老师也是这么唱的。", PB,
                            "要想唱得好，第1句最关键。更确切地说，就听第3个字——岛！" +
                            "不是单纯一个“岛”字儿，后面要“懊凹嗷”！没有转音，那属于唱得差的。", LB,
                            "同样地，“（摇）呀（摇）”和“（飘）呀（飘）”，也可以转一下。不过和“岛”相比，就没那么明显、那么重要了。", LB,
                            "有些版本里“（那）微（风）”、“（吹）开（了）”等也…… 看歌手自己发挥了。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "R2",
                                    arranged: "O0",
                                    chords:
                                    [
                                        [
                                            {2: C, 4: D7sus2, 10: C, 15: G},
                                            {1: Am, 5: D7sus2, 10: Dsus4, 15: G},
                                            {1: FM7, 6: Cadd9, 11: D7sus4, 17: G7},
                                            {1: Cadd9E, 6: D7sus2, 11: G6, 17: C}
                                        ],
                                        [
                                            {1: FM7, 8: D7sus4, 14: G7},
                                            {1: Cadd9, 7: Dm7, 12: G},
                                            {2: AmC, 8: G6},
                                            {1: AmE, 6: D7sus2, 11: FM7, 13: G6, 14: C}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "这绿岛像一只船 在月夜里摇呀摇",
                                "姑娘哟 你也在我的心海里飘呀飘",
                                "让我的歌声随那微风 吹开了你的窗帘",
                                "让我的衷情随那流水 不断地向你倾诉",
                                "椰子树的长影 掩不住我的情意",
                                "明媚的月光更照亮了我的心",
                                "这绿岛的夜已经这样沉静",
                                "姑娘哟 你为什么还是默默无语"
                            ]
                        },
                        postscript: "每小节配1个和弦，难度有点儿大噢？不如折成俩？",
                        details:
                        {
                            demo: TAG.video, // Ep.14 23:33.7 ~ 25:13.9
                            comment:
                            [
                                "应该是演员本人唱的，杨老师也是有名的歌手！", LB,
                                "有几处唱得有瑕疵，不过露营时唱着玩儿……", PB,
                                "示范演奏请参考", [TAG.BoA, "日版", "uta", "todo"], "。"///OTMGKRnAMgFR
                            ]
                        }
                    },
                    QSJS:
                    {
                        h2: "前世今生",
                        preface:
                        [
                            "旋律虽短，就这么几句，但在剧中配过多套歌词。", LB,
                            "起初没有固定的歌名，最终以当年《新白娘子传奇》的磁带里、第3首的名儿为准！", LB,
                            "数前年“好妹妹”用剧中第1次出现的词儿将它翻唱，所以现在大家都称之为《青城山下白素贞》。", PB,
                            "主歌有4段，只有最后1段的最后1个小节旋律不同，其它都一样，所以省略了2段。其中每段的第2句有点儿难度：",
                            [
                                TAG.ul,
                                [
                                    "第2个字要4转音，唱不到位就别唱这歌了；",
                                    "第4个字不能唱成单音，否则听起来总不是最好。"
                                ]
                            ],
                            "《青》的副歌中也有类似的现象，因为字数少；《前》不是很明显。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "O0",
                                    chords:
                                    [
                                        [
                                            {1: AmC, 3: Am7G, 5: Em7, 7: CG},
                                            {1: F, 3: Am7E, 5: Dm7, 7: G}
                                        ],
                                        [
                                            {1: Asus4, 4: EmB},
                                            {1: Fadd9, 4: G}
                                        ],
                                        [
                                            {1: AmC, 3: Am7G, 5: Em7, 7: CG},
                                            {1: F, 3: Am7E, 5: Dm7, 6: FA, 7: C}
                                        ],
                                        [
                                            {1: Dsus2, 5: G, 7: Am7E, 11: C},
                                            {1: Fadd9, 5: Am7E, 8: Dm7, 10: FA, 12: C}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "莫非前世那一眼",
                                "只为今生见一面",
                                "啊……啊……",
                                "啊……啊……",
                                "宁愿相守在人间",
                                "不愿飞作天上仙",
                                "嗨呀嗨嗨哟 嗨呀嗨嗨哟",
                                "让那缠缠绕绕的情意永缠绵"
                            ]
                        },
                        postscript:
                        [
                            "高潮中有2处可以玩一下扩展：",
                            [
                                TAG.ul,
                                [
                                    "G（跳过7，）加上9音、甚至加到11，都不错的；",
                                    "下一个C（不是最后结尾那个）加上7音效果很好！再加到9会更好？"
                                ]
                            ],
                            "唱两遍时，可以一段不加一段加，显得有变化。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "前奏特优美！最好用钢琴弹，吉它的话有点儿难？", LB,
                                [TAG.J2C, "编曲老师"], "参考了大量的钢琴谱和演奏视频，再加上软件的辅助，经过不断摸索、多次实践，" +
                                "终于编成了现在的前奏！大概是目前全网最好的吉它版？", PB,
                                "前奏的第2段，可当尾奏用。", LB,
                                "最后1句中的半音特别有味道！如果用大3音反而显得怪了？", PB,
                                "主旋律没有分成男女俩声部，因为原曲是一起合唱的。", LB,
                                "如果将主歌拆成男女各一句，也是不错的选择？"
                            ]
                        }
                    },
                    WYZJDFSAN:
                    {
                        h2: "我用自己的方式爱你",
                        preface:
                        [
                            "真姊々的代表作。应该也是她最好听的歌了吧？", PB,
                            "仔细听会发现：原唱中“悄悄”和“优柔”的旋律唱得略有不同，蛮特别的！", PB,
                            "高潮处的词儿写得很好！让人听了容易记住。", LB,
                            "“归依”，没有写成“皈依”，感觉后者好像太严肃了？"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "q0",
                                    chords:
                                    [
                                        [
                                            {3: Bsus4, 9: Bm},
                                            {3: Em7B, 11: A6E},
                                            {3: Bsus4, 9: Bm},
                                            {3: Esus2B, 11: Asus2, 13: Bm}
                                        ],
                                        [
                                            {1: Esus2, 7: Bm},
                                            {1: sFmCs, 7: [FWS, Bm]},
                                            {1: Esus2, 7: Bm},
                                            {1: GD, 5: A6, 8: [FWS, sFm]}
                                        ],
                                        [
                                            {1: Bm7, 8: sFm7A},
                                            {1: Bm7Fs, 5: sFm7Cs, 8: D, 9: DM7},
                                            {1: Bm7, 8: sFm7A},
                                            {1: Bm7Fs, 5: sFm7Cs, 7: [FWS, BmFs]}
                                        ],
                                        [
                                            {1: Bm7, 8: sFm7A},
                                            {1: Bm7Fs, 5: sFm7Cs, 8: D, 9: DM7},
                                            {1: Bm7, 8: sFm7A},
                                            {1: Bm7Fs, 5: sFm7Cs, 8: BmFs}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "我用自己的方式 悄悄地爱你",
                                "你是否为我的付出表示在意",
                                "我用这样的执着 优柔地对你",
                                "你是否为我的期待满怀歉意",
                                "喔 音乐缓缓响起",
                                "听见自己说爱你",
                                "喔 摇摆梦的旋律",
                                "幻想拥有你的甜蜜",
                                "哪怕你我感情的归依",
                                "一个向东一个向西",
                                "哪怕你我感觉的距离",
                                "一个在天一个在地",
                                "哪怕你我投射的眼睛",
                                "一个有心一个无意",
                                "哪怕你我最后的背影",
                                "一个安静一个哭泣"
                            ]
                        },
                        postscript:
                        [
                            "高潮处每句的第1小节旋律几乎是一样的。但如果弹法也一样，好像就不自然？", LB,
                            "偶数句为了配合歌词中的“一个…… 一个……”，拆成俩和弦。", PB,
                            [TAG.CHORD, DM7], "蛮有味道的噢？"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment: "前奏可当尾奏用。"
                        }
                    }
                }
            },
            xjp:
            {
                nav: "新加坡",
                header: {h1: "新加坡歌"},///／新谣
                main:
                {
                    CXCWCYD:
                    {
                        h2: "财兴财旺财运到",
                        preface:
                        [
                            "音域跨度蛮大的！最低的低至低音5；最高的高到高音2。如果算上前奏，得唱到高音3。", PB,
                            "找到个应该是原版的片头，右上角有字幕。有几处想讨论下：",
                            [
                                TAG.ul,
                                [
                                    "缭：原版用“撩”。",
                                    "仍：原版居然是“忍”，怎么理解？",
                                    "石：原版用“袋”。发音相近，且很难听清黄老师唱的哪个字，但感觉用“石”更好些。",
                                    "水：后面不断句了。",
                                    "情：本来以为两段都是“心”。用词不重复肯定更好。",
                                    "恼：换成“闹”意思好像也通？"
                                ]
                            ],
                            "某些网站刊登的歌词问题蛮多的，还有些低级错误。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "P2",
                                    arranged: "O0",
                                    chords:
                                    [
                                        [
                                            {1: C, 9: C},
                                            {1: Am, 9: Em},
                                            {1: Dsus2, 9: Dsus2},
                                            {1: F, 3: Gsus2, 7: C}
                                        ],
                                        [
                                            {3: C, 10: Am},
                                            {3: C, 7: Am7, 10: G},
                                            {2: F, 4: Cadd9, 8: Em7B, 11: Asus4},
                                            {2: D7sus2, 11: G, 12: Gsus4}
                                        ],
                                        [
                                            {2: C, 9: Am},
                                            {3: C, 7: Am7, 11: G},
                                            {2: F, 4: Cadd9, 8: Em7B, 11: Am7},
                                            {3: F, 9: G, 10: G7}
                                        ],
                                        [
                                            {1: C, 8: Gsus4},
                                            {1: Am7, 10: Em},
                                            {1: Dsus2, 8: Em7, 12: Am},
                                            {1: Dsus2, 7: G, 8: G7}
                                        ],
                                        [
                                            {1: C, 8: Gsus4},
                                            {1: Am7, 10: Em},
                                            {1: Dsus2, 8: Em7, 12: Am},
                                            {1: F, 5: Gsus2, 7: C}
                                        ],
                                        [
                                            {1: F, 3: Gsus2, 7: C}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "财兴财旺财运到 添福添贵添元宝",
                                "啦啦啦啦啦啦啦啦啦",
                                "财兴财旺财运到 添福添贵添元宝",
                                "啦啦啦啦啦啦啦",
                                "反正无事 就下凡来陪你走一遭",
                                "人间缭乱着 喧腾热闹",
                                "金银财宝 轻轻随手一掏",
                                "我有求必应 只怕你嫌少",
                                "安贫乐道 你仍为一石米折腰",
                                "利字当前 他两肋不插刀",
                                "身缠万贯 能否换得一笑",
                                "问苍天 天也不知晓",
                                "钱海大浪滔滔 人心左右摇",
                                "摇向柳暗花明 艳阳照",
                                "坐看白云飘飘 快乐自己找",
                                "好山好水好围绕",
                                "钱海大浪滔滔 人情来回恼",
                                "恼出两行眼泪 犯不着",
                                "坐看白云飘飘 今生有福了",
                                "财兴财旺财运到",
                                "啦啦啦啦啦啦啦"
                            ]
                        },
                        postscript:
                        [
                            "主歌第2句中的Am7可以不要，第2段同样如此。", LB,
                            "主歌第3句只用Fadd9和Cadd9/E也行，第2段同样如此。", LB,
                            "主歌第1段第4句中的D7sus2换成Dm7也行。", LB,
                            "主歌第2段第4句中，F后面嵌个Cadd9也行。", LB,
                            "副歌中的Gsus4感觉不是最优选择。为了突出两句旋律的差异，真的不要和上一个用同样的C。" +
                            "G肯定不行，其它候选有C/G、C6sus2、Cadd9等；或者折成俩。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "没想到居然有专辑版！", PB,
                                "原唱黄老师前几年……" + EMOJI.CRY, LB,
                                "以前觉得黄老师唱得一般，不过也可以理解，毕竟他不是专业歌手。其实尝试后就会发现蛮难唱的！", PB,
                                "前奏第2句末如果加花音来过渡，就把Em拆成Em7和Am7来打发turn-around时间。"
                            ]
                        }
                    },
                    ANYSXBG:
                    {
                        h2: "爱你一生嫌不够",
                        preface:
                        [
                            "梁老师的歌确实写得好，文学水平那也是相当了得！", PB,
                            "小调开头、大调结尾？"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "z1",
                                    arranged: "o0",
                                    chords:
                                    [
                                        [
                                            {1: Am, 7: Em},
                                            {1: Am7E, 7: Dm},
                                            {1: Dsus2, 7: D7sus2},
                                            {2: Dsus4, 8: Em}
                                        ],
                                        [
                                            {1: Am, 7: Em},
                                            {1: Am7E, 7: Dm},
                                            {1: Dsus2, 7: D7sus2},
                                            {2: Dsus4, 7: [FWS, C]}
                                        ],
                                        [
                                            {1: Am, 6: Em},
                                            {1: D7sus2, 7: G},
                                            {1: Am7, 6: Em7D},
                                            {1: D7sus2, 7: G}
                                        ],
                                        [
                                            {1: C, 7: Am7E},
                                            {1: F, 7: Em},
                                            {1: D7sus2, 7: Fadd9},
                                            {1: D7sus2, 7: G}
                                        ],
                                        [
                                            {1: Am, 7: Em},
                                            {1: Am7E, 7: Dm},
                                            {1: Dsus2, 7: D7sus2},
                                            {2: Dsus4, 8: C}
                                        ],
                                        [
                                            {1: Dsus2, 7: D7sus2},
                                            {2: D7sus4, 7: [FWS, C]}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "爱你一生嫌不够",
                                "想是前世爱过头",
                                "水也空自流 情也空自流",
                                "是爱人还是好朋友",
                                "爱你一生嫌不够",
                                "哪怕一望就白头",
                                "月也空自瘦 人也空自瘦",
                                "枕盟约不如拾红豆",
                                "欢暂且欢 忧亘古忧",
                                "牵衣总是多情柳",
                                "醒你已醒 梦我犹梦",
                                "相思中人易知秋",
                                "爱是无所留 爱是无所求",
                                "爱是从来无怨尤",
                                "谁负千行泪 谁悬一世愁",
                                "等你蓦然一回首",
                                "爱你一生嫌不够",
                                "来生还要拴着走",
                                "天地随你游 情路随你走",
                                "我不管有没有尽头",
                                "天地随你游 情路随你走",
                                "我不管有没有尽头"
                            ]
                        },
                        postscript: "几个2级和弦选得不错噢？将它的变种发挥得淋漓尽致" + EMOJI.HAPPY,
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "前奏分两段，和弦有些相似，但是又有变化。", LB,
                                "第3小节有点儿麻烦！就因为它，也考虑过用其它调来弹前奏。" +
                                "试下来就b调还行，但离原调反而更远。", LB,
                                "最后可以直接把前奏当尾奏用，和原曲不同。"
                            ]
                        }
                    },
                    DHWQ:
                    {
                        h2: "谍海危情",
                        preface:
                        [
                            "汤尼老师写的，其实是", [TAG.ALP, "台湾歌", "gequ/tw"], "。", LB,
                            "词儿像七言律诗？曲儿则有点儿戏曲的味道？", LB,
                            "前奏和主歌是小调，副歌转大调。", PB,
                            "主歌部分省略了第1段。", LB,
                            "第2句中的“轻”改成“尽”，意思更贴切？", LB,
                            "最欢喜“只求与你双倩影”这句，像黄梅戏哇？", LB,
                            "听到倒数第4句后的第一反应是“豪……”，再看歌词——噢，是“浩（然正）气”。", LB,
                            "最后1句是“漂（泊）”吧？好像两者都行。就以电视剧片头的字幕为准。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "r0",
                                    arranged: "o0",
                                    chords:
                                    [
                                        [
                                            {1: GD, 3: G, 5: Am7G, 7: G},
                                            {1: Dsus2, 3: Cadd9, 5: CM7, 7: Am},
                                            {1: Asus4, 3: D7sus2, 5: Asus4, 7: AmC},
                                            {1: G, 3: Am7, 4: [FWS, G], 5: [FWS, Dsus4], 7: G}
                                        ],
                                        [
                                            {1: C, 3: D7sus2, 5: Am7G, 7: GD},
                                            {1: C, 3: D7sus2, 5: Asus4, 7: AmC},
                                            {1: C, 3: Dsus2, 5: Am7G, 7: Em},
                                            {1: GD, 3: G6, 5: Cadd9, 6: Dm7, 7: C, 8: C}
                                        ],
                                        [
                                            {1: C, 3: D7sus2, 5: Am7G, 7: GD},
                                            {1: C, 3: D7sus2, 5: Asus4, 7: AmC},
                                            {1: C, 3: Dsus2, 5: Am7G, 7: Em},
                                            {1: G, 3: Fadd9, 4: [FWS, Am7G], 5: [FWS, G], 7: GD, 8: G}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "热血男儿保家国",
                                "儿女情意轻抛弃",
                                "纵有热爱千万缕",
                                "纷乱时刻难珍惜",
                                "世事成败非注定",
                                "红妆难舍俩深情",
                                "名利恩怨全抛开",
                                "只求与你双倩影",
                                "浩气挥洒千百里",
                                "壮烈牺牲何足惜",
                                "碧血飞溅不畏惧",
                                "飘泊天涯我独行"
                            ]
                        },
                        postscript:
                        [
                            "以G/D开头并结尾，这真是第一次碰到。最后用G来终止，这叫什么来着？半终止？" + EMOJI.SURPRISE, LB,
                            "如果算上前、尾奏，则像是小调的套路了。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "主歌处听着有些沉闷噢？但和副歌的衔接处突然加速，耳朵一下子就被叫醒了吧？", LB,
                                "高潮两段唱完，好像不过瘾、有点儿意犹未尽？再来一遍？" +
                                "把最后的G按照高潮间衔接处的节奏弹一遍，就可以再接高潮第1段了。", LB,
                                "总的来说，两处turn-around时间过渡得不错噢？", PB,
                                "前奏可当尾奏用。"
                            ]
                        }
                    },
                    HSCY:
                    {
                        h2: "回首尘缘",
                        preface:
                        [
                            "二李老师的歌确实写得好啊；卡斯老师的词儿写得也好！", PB,
                            "听了几句，会觉得某个音有点儿“怪”？再过几句，发现“怪音”又来了…… 正是这个半音，是整首歌的灵魂！", LB,
                            [TAG.J2C, "记谱老师"], "曾一度犹豫：要想避开半音也是可以的，但用《首调唱名法》唱起来有几句会感到别扭…… " +
                            "最终还是以唱得舒服来定调式！", PB,
                            "主歌部分省略了第2段。", LB,
                            "为了点题，最后两句歌词直接跳到了原曲的结束句。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "q0",
                                    chords:
                                    [
                                        [
                                            {1: Bm, 4: Eadd9Gs, 7: sFmCs, 9: Asus2},
                                            {3: D, 5: Dadd9Fs, 7: AE},
                                            {1: sFm, 3: Eadd9Gs, 6: Dadd9, 10: Em},
                                            {1: BmD, 5: AE, 6: [FWS, BmFs]}
                                        ],
                                        [
                                            {1: Bm, 2: Bm7, 4: Bm},
                                            {1: Bm, 2: Bm7, 3: [FWS, A6]},
                                            {1: sFm, 3: Eadd9Gs, 6: Dadd9, 9: Em},
                                            {1: BmD, 5: AE, 7: [FWS, BmFs], 9: Bm7}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "多少次笑语星眸",
                                "琼楼夜夜是笙歌",
                                "花飞花舞 不复计西东",
                                "愁绪化入晚风中",
                                "斜月如钩",
                                "为谁消瘦",
                                "回首尘缘 几许愁梦",
                                "恰似一江春水东流"
                            ]
                        },
                        postscript: "有半音的小节，要用大3，而不是小3。",
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "最后一句没有减速。", LB,
                                "如果唱两段或再加上结束句，那最后可以放慢来唱。"
                            ]
                        }
                    },
                    MBWDA:
                    {
                        h2: "明白我的爱",
                        preface:
                        [
                            "好像是黎天王自己作词作曲的" + EMOJI.SURPRISE, PB,
                            "歌名是“明白”，高潮非说是“不明白”，矛盾不？", LB,
                            "第2次改成“明白”了！下一句也一并改了。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "Z0",
                                    arranged: "O0",
                                    chords:
                                    [
                                        [
                                            {1: C, 8: C},
                                            {1: Am, 5: Em},
                                            {2: F, 8: Em},
                                            {0: F, 7: G}
                                        ],
                                        [
                                            {1: Am, 9: Em},
                                            {2: F, 8: C},
                                            {3: Dm, 9: Am},
                                            {3: F, 13: G}
                                        ],
                                        [
                                            {2: C, 9: Am},
                                            {2: F, 9: G},
                                            {2: C, 9: Am},
                                            {2: F, 8: G, 12: C}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "风里细雨一滴滴打进心里",
                                "流进寂寞的心底",
                                "你从来不知道 我对你的爱",
                                "疲惫的心满是期待",
                                "不管在梦中 或是你我在天涯",
                                "我的心将永远与你同在",
                                "昨天许下的诺言 今天变成了回忆",
                                "不用再说 不敢再看 我明白",
                                "你从来不明白 我唯一的恋爱",
                                "为什么心中充满著无奈",
                                "你一定会明白 我满心的期待",
                                "就这样永远不放开 我的爱"
                            ]
                        },
                        postscript: "……",
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "……", LB,
                                "……"
                            ]
                        }
                    },
                    SMDQT:
                    {
                        h2: "生命的晴天",
                        preface:
                        [
                            "和电视剧名中的“情”，偏旁不同。", PB,
                            "郭峰老师写的，其实是", [TAG.ALP, "大陆歌", "gequ/dl"], "。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "Z0",
                                    arranged: "X0",
                                    chords:
                                    [
                                        [
                                            {0: A, 5: [FWS, Eadd9Gs], 11: [FWS, sFm7], 15: [FWS, sCm]},
                                            {1: Dadd9, 5: [FWS, Esus4B], 9: [FWS, ACs], 10: E7},
                                            {0: A, 5: [FWS, Eadd9Gs], 11: [FWS, Bm7Fs], 13: [FWS, Eadd9B], 15: [FWS, AE], 16: A7},
                                            {1: Dadd9, 5: [FWS, Esus4B], 9: Asus4, 11: DM7, 13: Bm7, 15: sCsus4Gs}
                                        ],
                                        [
                                            {0: sFm, 5: [FWS, AM7], 10: [FWS, sFm7Cs], 15: [FWS, sCmE]},
                                            {0: D, 5: [FWS, Esus4B], 9: [FWS, ACs], 11: Bsus2, 13: sCm7, 15: sCmGs},
                                            {0: sFm, 5: [FWS, Bm7], 11: [FWS, sFm7], 16: [FWS, sCmE]},
                                            {0: D, 5: [FWS, sFmA], 11: [FWS, B7sus2], 16: [FWS, Eadd9]}
                                        ],
                                        [
                                            {1: Esus4, 5: A, 10: [FWS, E6], 15: sFm, 16: A7},
                                            {4: [FWS, DM7], 7: sFm7, 10: Bsus4, 12: DM7, 14: Esus4B},
                                            {0: A, 5: [FWS, E6], 10: sFm, 11: A7},
                                            {4: [FWS, DM7], 7: Bm, 9: E6, 12: Aadd9}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "喜怒哀乐起伏的情绪 伴随风和雨",
                                "冷暖四季好好地珍惜",
                                "悲欢离合岁月的足迹 能拥有自己",
                                "逆流之中不轻言后退",
                                "笑声埋藏多少泪水 何必记得清晰",
                                "阴天过去阳光在心底",
                                "红尘多少缠绵的爱恨 转眼就成回忆",
                                "能不能够无怨又无悔 坦然潇洒面对",
                                "Oh……  是非恩怨总有一线差距",
                                "我们都曾徘徊  也曾失迷",
                                "挫折创伤都将成为过去",
                                "我期待生命里  是永恒的天晴"
                            ]
                        },
                        postscript:
                        [
                            [TAG.CHORD, sFmA], "不转位好像有点儿怪？"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment: "前奏可当尾奏用，示范中简化了。"
                        }
                    },
                    XHDDK:
                    {
                        h2: "心花朵朵开",
                        preface:
                        [
                            "小调开头，高潮转成其同名大调。", PB,
                            "主歌第1段第2、第3句的韵脚都是“来”，所以把后一句改成“在”。“伴”好像也行？", LB,
                            "“多少”也用得有点儿多？", LB,
                            "第2段前3句的仨人称用得不错，没有重复。但“他”和“她”读音相同，所以把后一句改成“我”。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "p2",
                                    arranged: "o0",
                                    chords:
                                    [
                                        [
                                            {0: Am7, 4: A7sus4, 8: Dsus2, 11: [FWS, Em]},
                                            {0: F, 4: G6, 8: Dm, 11: [FWS, Cadd9E]},
                                            {0: F, 4: Esus4, 8: CM7},
                                            {0: Asus2, 4: CM7, 7: [FWS, Cadd9], 11: Am7, 12: [FWS, G]}
                                        ],
                                        [
                                            {0: Am7, 4: A7sus4, 8: Dsus2, 11: [FWS, Em]},
                                            {0: F, 4: G6, 8: Dm, 11: [FWS, Cadd9E]},
                                            {0: F, 4: Esus4, 8: CM7},
                                            {0: Asus2, 4: CM7, 8: Am, 12: F, 16: D7sus2C, 19: [FWS, AmE], 21: E7B}
                                        ]///D7sus2C toBeImproved?
                                    ]
                                },
                                {
                                    original: "Y2",
                                    arranged: "X0",
                                    chords:
                                    [
                                        [
                                            {0: Dadd9, 3: [FWS, E6], 8: A}
                                        ],
                                        [
                                            {5: [FWS, E6sus4], 11: [FWS, ACs]},
                                            {5: [FWS, Esus4], 11: [FWS, sFmA]},
                                            {7: Dadd9},
                                            {3: [FWS, B7sus2Fs], 10: [FWS, E6sus4B], 12: A}
                                        ],
                                        [
                                            {5: [FWS, E6sus4], 11: [FWS, ACs]},
                                            {5: [FWS, AM7E], 10: [FWS, sCsus4Gs], 11: [FWS, Dadd9]},
                                            {3: [FWS, E6sus4], 7: [FWS, sCm7]},
                                            {4: DM7, 7: [FWS, Esus4], 10: [FWS, A]}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "每天有多少感慨不能释怀",
                                "每天有多少抱怨张口就来",
                                "谁不想逢赌必赢好运常在",
                                "却不知多少算够 怎么放开",
                                "你觉得婆婆永远不够疼爱",
                                "她感到老公总是不理不睬",
                                "我嫌我父母不能给我未来",
                                "说穿了谁都贪心  却不知道 付出自己的爱……",
                                "喔呕呕 呕呕呕呕",
                                "心花朵朵开 要懂得灌溉",
                                "体谅和关怀 才会更愉快",
                                "谁被亏待 谁被疼爱",
                                "还不都是虚荣心在作怪……",
                                "心花朵朵开 要多点忍耐",
                                "风风和雨雨 一起扛下来",
                                "有种答案叫做看开",
                                "才会每天都能过得 精彩"
                            ]
                        },
                        postscript:
                        [
                            "主歌两段的第3句本来想用大7减5的，最后还是……", LB,
                            "“喔呕呕……”的前后进入转调。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "找到个2:20的音频，比电视剧版多了一遍副歌，可能就是完整版？", LB,
                                "因为第2遍从主歌开始唱的话，就得把调儿转回去，这个事情就讨厌了" + EMOJI.SAD
                            ]
                        }
                    }
                }
            },
            mlxy:
            {
                nav: "马来西亚",
                header: {h1: "马来西亚歌"},
                main:
                {
                    AB:
                    {
                        h2: "阿爸",
                        preface:
                        [
                            "原曲一开始是B调；唱完第1段后升半音。", LB,
                            "别看歌不长，小转音特别多！貌似有一半以上的字儿要转" + EMOJI.SURPRISE, LB,
                            "倒数第2句用的是原曲最后一遍高潮中的词儿，前面多了个“是”。且头俩字儿旋律也不同，要高8度！"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "Z0",
                                    arranged: "X0",
                                    chords:
                                    [
                                        [
                                            {1: Aadd9, 5: AE, 9: sFm, 13: Esus4},
                                            {1: Aadd9, 5: sFm7E, 10: B7sus2Fs, 14: EB},
                                            {1: Aadd9, 5: AE, 10: sFm, 14: D},
                                            {3: B7sus2Fs, 7: Bsus2, 11: D6, 15: A}
                                        ],
                                        [
                                            {2: AM7Cs, 5: E6sus4, 9: sFm7A, 11: Aadd9Cs},
                                            {3: Aadd9, 7: Aadd9E, 11: sFm7Cs, 12: D, 13: Esus4},
                                            {3: AM7Cs, 6: E6sus4, 10: sFm7A, 12: Aadd9Cs},
                                            {3: Aadd9, 7: D, 11: BmFs, 13: Esus4, 15: A}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "人生这一趟旅行 你形影不离",
                                "喜欢你的字字句句 学你的语气",
                                "经过岁月的洗礼 你头发已白尽",
                                "才明了原来当时的你 爱有多彻底",
                                "你让我穿上最美丽的翅膀",
                                "给我勇气让我坚定地 去飞翔",
                                "是你让我看见黑夜里的光亮",
                                "陪着我 轻轻地 坐在月光下歌唱"
                            ]
                        },
                        postscript:
                        [
                            "粗配时因看错了调，整了个D6上去。结果发现再合适不过了——歪打正着" + EMOJI.HAPPY, LB,
                            "其实另有几处也错配成D6，但听着好像也没啥问题，不过都改了。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "因为旋律相同，前、尾奏比起原曲裁掉了一半。且暂时偷个懒，只用了俩琶音了事儿。" + EMOJI.AWKWARD, LB,
                                "示范取自升调前的第1段。"
                            ]
                        }
                    },
                    NHGN:
                    {
                        h2: "南海姑娘",
                        preface:
                        [
                            "从来没有怀疑过原唱不是邓小姐…… 结果大吃一惊——居然是马来西亚歌铱钢" + EMOJI.SURPRISE, PB,
                            "原曲是降E调，邓小姐唱的是C。", LB,
                            "主歌部分省略了第2段。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "R2",
                                    arranged: "O0",
                                    chords:
                                    [
                                        [
                                            {0: Cadd9, 5: [FWS, F]},
                                            {0: FM7, 5: [FWS, C]},
                                            {3: CM7, 6: Bm7b5, 8: G7},
                                            {3: Am7, 6: GD, 9: C}
                                        ],
                                        [
                                            {0: Csus4, 4: F},
                                            {0: Fadd9, 5: Gsus2},
                                            {0: Am7G, 5: GB},
                                            {0: Esus4B, 5: C, 6: FA, 7: EmG, 8: DmF, 9: Cadd9}
                                        ],
                                        [
                                            {5: [FWS, F]},
                                            {0: FM7, 5: [FWS, C]},
                                            {3: CM7, 6: Bm7b5, 7: [FWS, G7]},
                                            {3: Am7, 6: GD, 9: C}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "椰风挑动银浪",
                                "夕阳躲云偷看",
                                "看见金色的沙滩上",
                                "独坐一位美丽的姑娘",
                                "她在轻叹",
                                "叹那无情郎",
                                "想到泪汪汪",
                                "湿了红色纱笼白衣裳",
                                "哎呀南海姑娘",
                                "何必太过悲伤",
                                "年纪轻轻只十六半",
                                "旧梦失去有新侣做伴"
                            ]
                        },
                        postscript:
                        [
                            "本来不是很感兴趣。结果扫了一眼之后，突然发现要用到半减，那就玩玩儿吧" + EMOJI.SMILE, PB,
                            "Gsus2好像有点儿怪噢？", LB,
                            "Esus4的效果好像还不错噢？换成半减也行。", LB,
                            "后面的4连击蛮爽的吧！"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "参考邓小姐的版本来编的。", LB,
                                "前奏可当尾奏用。"
                            ]
                        }
                    },
                    WWCTX:
                    {
                        h2: "娃娃闯天下",
                        preface:
                        [
                            "照理说祁老师是有名的作词家，不应该质疑他写的东西。但这第1句真的是不太好呀？又是“笆”啊，又是“几”的……" +
                            EMOJI.AWKWARD, LB,
                            "咱撇开无聊的话题不说，那什么叫“篱笆盛开……”？虽然意思大家都懂，但就是怪呀；" +
                            "“几”后面略作停顿，“……朵大红花”一起唱出来总觉得很别扭！", LB,
                            "别扭，还有其它原因，就是旋律也不太顺。虽然原曲也没多大毛病，但好像有瑕疵？", LB,
                            [TAG.J2C, "音乐指导老师"], "也有同感，并给出了几个修改方案。………………", PB,
                            "有几句歌词改了，有的需要说明下：",
                            [
                                TAG.ul,
                                [
                                    [
                                        "“篱笆盛开几朵大红花”", LB,
                                        "保留了“大红花”" + EMOJI.SMILE
                                    ],
                                    [
                                        "“家里的娃娃在学着爬”", LB,
                                        "这句没毛病！只因上句经修改后也有了个“家”；下句又有“着”。为了避免重复……"
                                    ],
                                    [
                                        "“（它张开小嘴）说（着咿呀咿呀）”", LB,
                                        "换个动词儿，好像更贴切？"
                                    ],
                                    [
                                        "“（每一天）呵（护看着它长大）”", LB,
                                        "原唱念白字" + EMOJI.AWKWARD
                                    ],
                                    [
                                        "“再多辛劳也不会退下”", LB,
                                        "韵也押了，句意也能看懂。但总是有点儿怪？改了。"
                                    ],
                                    "最后一句为了点题，直接跳到原曲的结束句。"
                                ]
                            ],
                            "后面几段都蛮好的！", PB,
                            "原曲的结束段升一个半音。"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "P2",
                                    arranged: "O0",
                                    chords:
                                    [
                                        [
                                            {4: CE, 9: [FWS, Cadd9]},
                                            {4: Am7, 9: [FWS, Cadd9E]},
                                            {4: CM7, 8: [FWS, Esus4B]},
                                            {0: Am7, 4: Fadd9, 10: [FWS, C], 12: CM7G}
                                        ],
                                        [
                                            {4: CE, 6: GD, 8: Esus4},
                                            {0: Am7, 4: Fadd9, 7: C, 9: [FWS, CE]},
                                            {0: Gadd9, 4: CE, 6: Dsus2, 8: [FWS, FM7]},
                                            {0: Em7, 4: F, 6: Gsus4, 8: [FWS, C]}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "家门口开满了大红花",
                                "屋里的娃娃刚学会爬",
                                "它张开小嘴叫着咿呀咿呀",
                                "一脸的童真里无牵无挂",
                                "每一天呵护看着它长大",
                                "即使再多辛劳也不怕",
                                "随着它健康成长的步伐",
                                "阿爸看娃娃闯天下"
                            ]
                        },
                        postscript:
                        [
                            "……", LB,
                            "……"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "前奏很吸引人！", LB,
                                "高潮换成激烈点儿的节奏也行；示范中还是保持小清新风格。"
                            ]
                        }
                    }
                }
            }
        }
    },
    uta:
    {
        language: "ja",
        nav: "うた",
        header: {h1: "日本（語）の曲／演歌"},
        main:
        {
            HyKIkKnFuSn:
            {
                h2: "101個の風船",
                preface:
                [
                    "歌詞が長すぎるか？3番なんてもったいない。2番＋ラストサビという構成はどう？", PB,
                    "メロディーの最後に半音がある。"
                ],
                section:
                {
                    score:
                    [
                        {
                            original: "T0",
                            chords:
                            [
                                [
                                    {3: FC, 10: GmD},
                                    {3: bB, 6: C6G},
                                    {2: DmF, 5: [DFWS, AmE]},
                                    {1: [FWS, Dm7], 8: bBM7, 10: C7G}
                                ],
                                [
                                    {2: FC, 10: GmD},
                                    {1: [FWS, bB], 9: C6G},
                                    {3: DmF, 8: [DFWS, AmE]},
                                    {1: bBadd9D, 7: [FWS, CG], 9: F, 10: CG}
                                ],
                                [
                                    {3: FC, 5: [FWS, FA], 6: [DFWS, AmE], 8: CG},
                                    {2: Dm, 5: Fadd9, 8: AmE, 12: AmC},
                                    {1: [DFWS, bBM7F], 5: [FWS, CG], 7: AmE, 8: Csus4, 9: Fadd9},
                                    {2: A7sus4E, 6: Dm, 9: Am, 11: Csus4G}
                                ],
                                [
                                    {3: F, 5: [DFWS, FA], 6: [DFWS, AmE], 10: CG},
                                    {2: Dm, 5: FM9, 10: AmE, 12: [DFWS, AmC]},
                                    {1: [DFWS, bBM7F], 5: C, 6: [DFWS, AmE], 7: GmM7Bb, 8: DFs},
                                    {3: Gm, 7: [FWS, Csus4], 9: [FM9A, DFWS], 10: [FWS, F]}
                                ]
                            ]
                        }
                    ],
                    lyrics:
                    [
                        "歌歌歌歌歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞詞",
                        "ななななな",
                        "しししししししししし",
                        "歌歌歌歌歌歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞詞詞詞詞詞詞詞",
                        "なななななななな",
                        "ししししししし",
                        "歌歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞詞詞詞詞詞詞",
                        "ななななななななな",
                        "ししししししししししし",
                        "歌歌歌歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞詞詞詞詞詞詞",
                        "なななななななな",
                        "しししししししししし"
                    ]
                },
                postscript:
                [
                    "前述した半音のために、特殊なコードを付いた。", LB,
                    "マイナー・メジャー・セブンスは合っているらしい" + EMOJI.SMILE
                ],
                details:
                {
                    demo: TAG.audio,
                    comment:
                    [
                        "前奏が終わってから、テンポは速くなる。", LB,
                        "前奏にも半音がある。"
                    ]
                }
            },
            OGnKDSK_OTuSn:
            {
                h2: "お元気ですか お父さん",
                preface:
                [
                    "……", PB,
                    "……"
                ],
                section:
                {
                    score:
                    [
                        {
                            original: "W2",
                            arranged: "V0",
                            chords:
                            [
                                [
                                    {2: [FWS, GB], 9: [DFWS, Dsus2]},
                                    {3: Em7B, 11: D7},
                                    {3: [G, FWS], 7: [Bm7Fs, DFWS]},
                                    {1: Cadd9E, 7: Cadd9G, 12: Gadd9B, 14: D6sus4A}
                                ],
                                [
                                    {2: [G, FWS], 9: [Dsus2, DFWS]},
                                    {3: Em7B, 9: D7},
                                    {2: G, 8: [Bm7, FWS]},
                                    {1: [CE, DFWS], 5: CG, 8: D, 10: G, 11: C}
                                ],
                                [
                                    {0: GM7, 3: Esus4, 6: [DFWS, Gadd9D], 9: Bm, 13: [DFWS, GM7D]},
                                    {1: [DFWS, Esus4], 5: [DFWS, Gadd9B], 9: BmFs, 13: [FWS, D]},
                                    {2: B7, 5: E7, 9: Asus2, 14: G},
                                    {1: [Esus2B, DFWS], 6: C, 8: [DFWS, Asus2], 11: D, 12: D7A}
                                ],
                                [
                                    {1: Gadd9D, 7: Bm7},
                                    {2: [FWS, GM7], 4: EmB},
                                    {1: Asus2E, 7: Am7},
                                    {2: CG, 4: Cm, 7: Dsus4, 9: G}
                                ]
                            ]
                        }
                    ],
                    lyrics:
                    [
                        "歌歌歌歌歌歌 歌歌歌歌",
                        "詞詞詞詞詞詞詞詞詞詞詞",
                        "なななななななな",
                        "しししししししししししし……",
                        "歌歌歌歌歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞詞詞詞",
                        "なななななな な",
                        "しししししししししし",
                        "歌歌歌歌歌歌 歌歌歌歌歌歌",
                        "詞詞詞詞詞 詞詞詞詞詞詞詞",
                        "ななななな なななななななな",
                        "しししししし しししし",
                        "歌歌歌歌歌歌歌",
                        "詞詞詞詞",
                        "ななななななな",
                        "しししししししし"
                    ]
                },
                postscript: "……",
                details:
                {
                    demo: TAG.audio,
                    comment:
                    [
                        "……", LB,
                        "……"
                    ]
                }
            },
            KYMChnOnN:
            {
                h2: "木屋町の女",
                preface:
                [
                    "同じ名前の曲は2つあるそうだ。ここでは青江三奈が唄った。", PB,
                    "コードは3番の（仮）歌詞に揃える。"
                ],
                section:
                {
                    score:
                    [
                        {
                            original: "Y2",
                            arranged: "X0",
                            chords:
                            [
                                [
                                    {2: A, 3: sFm7Cs, 7: sFm},
                                    {2: D, 3: [B7sus4, DFWS], 5: EGs},
                                    {3: AE, 4: sFm7Cs, 8: sFsus4},
                                    {0: Bsus2, 4: E6sus4, 7: [FWS, A]}
                                ],
                                [
                                    {0: sFm, 3: [sFm7, DFWS], 5: A, 8: B7sus2},
                                    {0: E, 3: sFm7E, 7: sFm7Cs},
                                    {2: D, 4: B7sus4, 8: [Dadd9, DFWS], 11: Esus2},
                                    {1: [FWS, sCm], 2: E6sus4, 4: [FWS, A]}
                                ]
                            ]
                        }
                    ],
                    lyrics:
                    [
                        "歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞",
                        "ななななななななな",
                        "ししししししし",
                        "歌歌歌歌  歌歌歌歌歌歌",
                        "詞詞詞詞詞詞詞",
                        "なな なななななななな",
                        "しししし"
                    ]
                },
                postscript: "A/Eはベース音を指定しなくてもいい。",
                details:
                {
                    demo: TAG.audio,
                    comment:
                    [
                        "前奏の最後における低音によって、GのかわりにAキーでアレンジした。", LB,
                        "前奏と後奏における32分音符（3連符じゃないよう）を聞くと心地よい。"
                    ]
                }
            },
            KuSI:
            {
                h2: "香水",
                preface:
                [
                    "歌詞における（半角の）ローマ字は（全角の）漢字に置換されている。", LB,
                    "メロディーが似っている部分は省略されている。残りはAメロの前半とAダッシュメロの後半で、意味も合っている。", LB,
                    "最後の段落は「ドゥドゥドゥ……」だ。"
                ],
                section:
                {
                    score:
                    [
                        {
                            original: "R2",
                            arranged: "Q0",
                            chords:
                            [
                                [
                                    {3: DA, 4: D6, 8: DA},
                                    {0: Dadd9Fs, 4: D6, 7: Gadd9, 11: A6sus4},
                                    {0: D6, 3: DA, 4: D6, 7: A6sus4},
                                    {0: Dadd9Fs, 4: GM7D, 7: DFs, 10: [FWS, DA]}
                                ],
                                [
                                    {4: D, 7: E7sus2, 9: [FWS, sFm]},
                                    {4: Gadd9, 7: [A6, FWS], 8: [FWS, DFs]},
                                    {3: [Bm7, FWS], 6: Asus2, 10: Gadd9, 14: DA},
                                    {3: [G, FWS], 6: A6sus4, 10: D}
                                ],
                                [
                                    {3: [D6A, FWS], 8: D},
                                    {3: D6A, 8: [FWS, D]},
                                    {3: D6A, 8: D, 12: [FWS, Dadd9Fs]},
                                    {3: [GM7, FWS], 5: Asus4E, 9: DM7A, 10: D}
                                ],
                                [
                                    {1: G, 3: [FWS, E7sus2], 5: [FWS, Dadd9Fs], 7: [FWS, D]},
                                    {1: G, 3: [FWS, E7sus2], 5: [FWS, DFs]},
                                    {1: G, 3: [FWS, E7sus2], 5: [FWS, Dadd9Fs], 7: [FWS, D]},
                                    {1: G, 3: [FWS, Asus4E], 5: [FWS, D]}
                                ]
                            ]
                        }
                    ],
                    lyrics:
                    [
                        "歌歌歌  歌歌歌歌歌",
                        "詞詞詞詞詞詞詞詞詞詞詞詞詞",
                        "ななな  なななななな",
                        "しししししししししし",
                        "歌歌歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞詞詞",
                        "なななななな ななななななな",
                        "しししししししししし",
                        "歌歌歌歌歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞詞詞詞詞詞",
                        "ななななななななななななな",
                        "ししししししししし",
                        "歌歌歌歌歌歌歌",
                        "詞詞詞詞詞",
                        "ななななななな",
                        "ししししし"
                    ]
                },
                postscript:
                [
                    "全曲（前奏を含む）における1番目のコードがGのせいで、オリジナルがGキーでアレンジされたと勘違いをしていたが、" +
                    "Gにおいて、Aコードが一般的に使われないので、キーはDだ。", LB,
                    "では同様に、Dに", [TAG.sup, ACCIDENTAL.P],
                    "F7があるか？これはセカンダリー・ドミナント・コードで、コード進行をいい感じにアレンジする手法だ。", PB,
                    "ここで、前奏以外に新しいコードを付けて、原曲と異なる。"
                ],
                details:
                {
                    demo: TAG.audio,
                    comment:
                    [
                        "弾き方の解説ビデオを何本か見たが、" +
                        "中では前奏におけるG" + ARROW + "A" + ARROW + "Dのコード・チェンジが不便なような気がする" + EMOJI.SAD, PB,
                        "前奏の8小節は次のメロディーにすべて適用できる。つまり、その8小節しか練習しなければ十分だ。" +
                        "したがって、弾き語りは難しくない。しかし、間奏は少し難しい。", PB,
                        "ところで、オリジナルの間奏は後奏として使われている。"
                    ]
                }
            },
            SBTnnHN:
            {
                h2: "サボテンの花",
                preface:
                [
                    "財津和夫の曲では一番いいらしい。", PB,
                    "2番目は省略されている。"
                ],
                section:
                {
                    score:
                    [
                        {
                            original: "V0",
                            chords:
                            [
                                [
                                    {3: [FWS, G], 7: CG, 11: [FWS, G], 13: CG, 14: G},
                                    {2: Bm, 4: [FWS, Em], 7: Am9, 8: D7},
                                    {2: G, 6: CG, 11: G, 13: Bm},
                                    {2: [FWS, CD], 6: CE, 8: [FWS, G], 10: G}
                                ],
                                [
                                    {3: C, 10: DC, 14: Bm, 18: Em},
                                    {0: Am7, 5: D7, 10: G, 11: G7},
                                    {2: C, 7: DC, 11: Bm, 15: Em},
                                    {0: Am7, 5: D7, 9: G}
                                ]
                            ]
                        }
                    ],
                    lyrics:
                    [
                        "歌歌歌 歌歌歌 歌歌歌歌",
                        "詞詞 詞詞詞詞",
                        "なな ななな ななななな",
                        "ししし しし しし",
                        "歌歌歌歌歌 歌歌歌歌歌 歌歌 歌歌歌歌歌",
                        "詞詞詞詞詞 詞詞詞詞",
                        "なな ななななな なな ななななな",
                        "ししししし ししし"
                    ]
                },
                postscript:
                [
                    "C/Dもあるし、D/Cもある" + EMOJI.AWKWARD, LB,
                    "D/Cは難しいか？かわりに、Dを使ってもいい。"
                ],
                details:
                {
                    demo: TAG.audio,
                    comment:
                    [
                        "前奏は本当にいいね！2つの基本コードでも美しいメロディーが作れるね" + EMOJI.SURPRISE, LB,
                        "さすが財津先生！", PB,
                        "前奏は2種類ある。ここでミックスして、1小節ずつ演奏した。", LB,
                        "オリジナルは同じ小節で4回演奏される。"
                    ]
                }
            },
            SnRKSnRK:
            {
                h2: "3636",
                preface:
                [
                    "偶然見つけて、気に入った。おもしろい曲名で、いい歌だね。", LB,
                    "初めて「3636」を聞いて、さっぱりわからなかった" + EMOJI.SURPRISE
                ],
                section:
                {
                    score:
                    [
                        {
                            original: "Y2",
                            arranged: "V0",
                            chords:
                            [
                                [
                                    {5: Gadd9D, 7: G, 11: Em7, 13: Bm7},
                                    {2: C6sus2, 8: Em7, 13: C, 21: Dsus4},
                                    {0: G6, 7: Em7, 13: A7sus2, 15: [FWS, Gadd9B]},
                                    {4: [CM7, FWS], 5: [FWS, D7sus4A], 8: G, 9: D7}
                                ],
                                [
                                    {5: Gadd9D, 7: G, 11: E7sus4B, 18: Asus2},
                                    {2: C6sus2G, 9: [FWS, Em7], 14: CM7, 20: [FWS, Dsus4]},
                                    {0: G6, 8: Em7, 14: A7sus2, 16: [FWS, Gadd9B]},
                                    {2: C, 6: D6sus4A, 8: GB, 9: G, 10: C}
                                ],
                                [
                                    {1: [FWS, Gadd9], 4: [FWS, D6sus4], 9: [FWS, AmE], 13: B7sus4Fs},
                                    {1: Gadd9, 4: [FWS, D6sus4], 9: AmE, 10: CM7, 12: [FWS, D], 14: DA, 16: DFs, 18: D7}
                                ],
                                [
                                    {3: G, 10: [Em7B, FWS], 16: CM9, 21: [Gadd9, FWS]},
                                    {2: A7sus2, 6: [FWS, Em7], 8: [FWS, Cadd9], 12: [FWS, D6A]},
                                    {3: G, 10: [Em7B, FWS], 17: [DFWS, C], 20: D6A, 24: Em},
                                    {3: [GM7B, DFWS], 5: [FWS, Em7D], 10: Cadd9, 12: Dsus4A, 14: G}
                                ]
                            ]
                        }
                    ],
                    lyrics:
                    [
                        "歌歌歌歌歌歌  歌歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞詞詞 詞詞詞詞詞詞詞詞詞詞詞詞詞詞詞詞",
                        "なななななな  なななななななな",
                        "しししししししし",
                        "歌歌歌歌歌歌  歌歌歌歌歌歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞詞詞詞 詞詞詞詞詞詞詞詞詞詞詞詞詞詞",
                        "ななななななな  なななななななな",
                        "しししし ししし",
                        "歌歌歌歌歌歌歌 詞詞詞詞詞詞詞",
                        "ななななななしししししし",
                        "歌歌歌歌歌歌歌 歌歌歌歌歌 歌歌歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞 詞詞詞 詞詞詞",
                        "ななななななな ななななななな なななななななな",
                        "ししし ししししししししししし"
                    ]
                },
                postscript:
                [
                    "AメロとAダッシュメロとでは、コードがいくつか違う。", LB,
                    "サビにも……"
                ],
                details:
                {
                    demo: TAG.audio,
                    comment: "オリジナルの間奏は後奏として使われている。"
                }
            },
            HMBnUT:
            {
                h2: "浜辺の歌",
                preface:
                [
                    "原調は変イ長調だそうだ。", LB,
                    "一番早く唄った歌手さんは李香蘭か？", PB,
                    "コードは1番しか載せていない。"
                ],
                section:
                {
                    score:
                    [
                        {
                            original: "W2",
                            arranged: "V0",
                            chords:
                            [
                                [
                                    {2: G, 4: [G, FWS], 5: Am, 6: Em, 9: G, 10: G, 12: D, 13: D7},
                                    {1: G, 2: G, 4: Am, 5: Em, 8: G, 9: D7, 11: G, 12: G},
                                    {1: [FWS, D], 3: [Daug, FWS, G], 4: G, 6: [FWS, C], 8: Am7, 10: D, 11: D7},
                                    {2: G, 4: [G, FWS, Am], 5: Em, 7: [FWS, G], 9: [D, FWS], 10: G},
                                ]
                            ]
                        }
                    ],
                    lyrics:
                    [
                        "歌歌歌歌歌歌 歌歌歌歌歌",
                        "詞詞詞詞詞 詞詞詞詞詞",
                        "なななな ななななな",
                        "ししししし しししし"
                    ]
                },
                postscript: "増3和音は本曲で最も核心的だ！",
                details:
                {
                    demo: TAG.video, // Ep8 19:51.3~20:35.9
                    comment:
                    [
                        "augコードが使われなかったらしい。", PB,
                        "陳先生は本当にピアノが弾けるようだ。"
                    ]
                }
            },
            HRwMTsHN:
            {
                h2: "春を待つ花",
                preface:
                [
                    "中国語版の曲名は「相見在明天」だ。", LB,
                    "テレサ・テンの曲では一番いいような気がする" + EMOJI.SMILE
                ],
                section:
                {
                    score:
                    [
                        {
                            original: "X0",
                            chords:
                            [
                                [
                                    {1: Aadd9, 3: sFm7Cs, 6: A},
                                    {1: [ACs, FWS], 2: D, 5: Esus2},
                                    {1: A, 3: B7sus2, 7: sFm7E},
                                    {1: Bsus2, 3: sF7sus4, 7: A}
                                ],
                                [
                                    {1: Aadd9, 2: [FWS, sFm7Cs], 5: A},
                                    {1: [ACs, FWS], 2: [FWS, D], 6: Esus2},
                                    {1: [Aadd9, FWS], 3: Dadd9, 5: [sFmCs, FWS], 8: E},
                                    {0: Bsus2, 3: Dadd9, 4: [FWS, E6], 6: A}
                                ],
                                [
                                    {1: [Bm7, DFWS], 2: Bsus2, 4: sFm7E, 8: sFm},
                                    {1: [A, DFWS], 3: [sFm7E, FWS], 6: Aadd9, 10: EB},
                                    {1: [A, FWS, B7sus2], 4: A, 5: sCm7, 7: [FWS, Aadd9], 9: E6},
                                    {1: sCm7, 5: ACs, 7: Dadd9, 11: D, 12: A, 15: E6, 17: EB, 18: E}
                                ],
                                [
                                    {1: [Aadd9, FWS], 2: sFm7Cs, 5: A},
                                    {0: Dadd9A, 2: D, 4: [FWS, A]}
                                ]
                            ]
                        }
                    ],
                    lyrics:
                    [
                        "歌歌歌歌歌歌歌",
                        "詞詞詞詞詞",
                        "なななななななな",
                        "ししししししし",
                        "歌歌歌歌歌歌",
                        "詞詞詞詞詞詞",
                        "なななななななな",
                        "しししししし",
                        "歌歌 歌歌歌歌歌",
                        "詞詞詞詞詞詞詞詞詞詞",
                        "なななな  なななな",
                        "ししししししししししし  ししししし",
                        "歌歌歌詞詞詞",
                        "なななししし"
                    ]
                },
                postscript:
                [
                    "Aメロにおける", [TAG.CHORD, sF7sus4], "は、Aダッシュメロにおいて、Dadd9とE6に分けた。"
                ],
                details:
                {
                    demo: TAG.audio,
                    comment:
                    [
                        "日本語より中国語の歌詞で歌ったほうがいいか？", LB,
                        "だから、メロディーは中国語版だ。"
                    ]
                }
            }
        }
    },
    nolae:
    {
        language: "ko",
        nav: "노래",
        header: {h1: "한국 노래"},
        main:
        {
            DHnuSl:
            {
                h2: "단 하나의 사랑",
                preface: "심정훈,《북경, 내 사랑》주제가",
                section:
                {
                    score:
                    [
                        {
                            original: "X0",
                            chords:
                            [
                                [
                                    {3: [FWS, A], 8: [FWS, sFm7E], 13: [FWS, sFm]},
                                    {0: AM7, 4: D, 9: [FWS, EB], 13: [FWS, Eadd9], 17: [FWS, Asus4]},
                                    {2: [FWS, DM7], 5: B7sus2, 8: [FWS, E], 10: E7B},
                                    {0: AM7, 3: [FWS, AE], 5: AE, 6: A}
                                ],
                                [
                                    {0: E, 3: [FWS, A], 7: [FWS, E7B]},
                                    {4: [FWS, DM7], 9: [FWS, A]},
                                    {3: DM7, 5: [FWS, Aadd9Cs]},
                                    {3: [FWS, Bm7], 7: E7Gs, 11: [FWS, Aadd9]}
                                ],
                                [
                                    {3: [FWS, Bm7]},
                                    {2: [FWS, DM7], 7: [FWS, sFmA]},
                                    {4: D, 10: [FWS, AM7]},
                                    {0: sCm7, 3: [FWS, Bm7], 8: Esus4, 16: [FWS, AM7]}
                                ],
                                [
                                    {4: [FWS, E7]},
                                    {2: [FWS, Dadd9], 8: AE},
                                    {5: [FWS, sFmA], 11: [FWS, B7sus4]},
                                    {3: [FWS, DM7], 9: [FWS, EB]}
                                ],
                                [
                                    {0: E7, 3: [FWS, A], 8: [FWS, sFm7E], 13: [FWS, sFm]},
                                    {0: AM7, 4: D, 9: [FWS, EB], 13: [FWS, Eadd9], 17: [FWS, Asus4]},
                                    {2: [FWS, DM7], 5: B7sus2, 8: [FWS, E], 10: E7B},
                                    {0: AM7, 3: [FWS, AE]}
                                ]
                            ]
                        }
                    ],
                    lyrics:
                    [
                        "언제나  너의 곁에 있을게",
                        "다시 내 삶의 의미를 찾게 해준",
                        "소중한 널 위해",
                        "영원히",
                        "몰랐어  나에게",
                        "없는 줄만 알았던",
                        "이 세상에  하나뿐인",
                        "사랑이  남아있다는 걸",
                        "믿어봐",
                        "네게 약속할게",
                        "내가 찾은 이 길의 태양",
                        "희망은  결코 변하지 않을 테니",
                        "지루했던",
                        "고통의 시간마저",
                        "너로 인해  다시 새로운",
                        "의미를 찾을 테니",
                        "언제나  너의 곁에 있을게",
                        "다시 내 삶의 의미를 찾게 해준",
                        "소중한 널 위해",
                        "영원히"
                    ]
                },
                postscript: "가장조의 코드가 어렵나요?",
                details:
                {
                    demo: TAG.audio,
                    comment: "솔로 편곡이 어렵네요."
                }
            },
            SleCbeBmGay:
            {
                h2: "사랑은 창밖에 빗물 같아요",
                preface: "Love Is Like the Rain over the Window",
                section:
                {
                    score:
                    [
                        {
                            original: "X0",
                            chords:
                            [
                                [
                                    {3: [FWS, A], 8: [FWS, sFm7E], 13: [FWS, sFm]},
                                    {0: AM7, 3: [FWS, AE], 5: AE, 6: A}
                                ],
                                [
                                    {0: E, 3: [FWS, A], 7: [FWS, E7B]},
                                    {3: [FWS, Bm7], 7: E7Gs, 11: [FWS, Aadd9]}
                                ],
                                [
                                    {3: [FWS, Bm7]},
                                    {0: sCm7, 3: [FWS, Bm7], 8: Esus4, 16: [FWS, AM7]}
                                ],
                                [
                                    {0: E7, 3: [FWS, A], 8: [FWS, sFm7E], 13: [FWS, sFm]},
                                    {0: AM7, 4: D, 9: [FWS, EB], 13: [FWS, Eadd9], 17: [FWS, Asus4]},
                                    {2: [FWS, DM7], 5: B7sus2, 8: [FWS, E], 10: E7B},
                                    {0: AM7, 3: [FWS, AE]}
                                ]
                            ]
                        }
                    ],
                    lyrics:
                    [
                        "이 밤 왠지 그대가",
                        "내곁에 올것만 같아 음",
                        "그대 떠나 버린걸",
                        "난 지금 후회 안해요  오오오오",
                        "그저 지난 세월이",
                        "내리는 빗물 같아요",
                        "그렇지만 문득 그대  떠오를때면",
                        "이 마음은 아파올꺼야",
                        "그 누구나 세월가면  잊혀지지만",
                        "사랑은 창밖에  빗물 같아요"
                    ]
                },
                postscript: "가장조의 코드가 어렵나요?",
                details:
                {
                    demo: TAG.audio,
                    comment: "..."
                }
            }
        }
    },
    song:
    {
        language: "en",
        nav: "Song",
        classification:
        {
            us:
            {
                nav: "US",
                header: {h1: "American Songs"},
                main:
                {
                    RRILY:
                    {
                        h2: "Rose, Rose, I Love You",
                        preface:
                        [
                            "It has been reported that Americans do not believe that this is a ",
                            [TAG.BoA, "Chinese song", "gequ/dl", "MGMGWAN"],
                            ", whose title has the same meaning as the English one" + EMOJI.SURPRISE, PB,
                            "The paragraphs with the same melodies are omitted.", LB,
                            "The ending lyrics are changed."
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "O0",
                                    chords:
                                    [
                                        [
                                            {1: CM9, 13: CM7E, 22: Dm7, 37: G7},
                                            {1: CM9, 14: FM7, 21: Am7G, 36: G7D},
                                            {2: Am7E, 17: Am7G, 31: G7D, 45: Em7},
                                            {2: CM9, 13: FM7, 20: G7D, 28: CM7}
                                        ],
                                        [
                                            {1: CM7, 8: Dm7A, 14: Bm7b5, 23: CM7G},
                                            {1: G7D, 10: CM9, 20: Am7G, 30: CM7E},
                                            {1: CM7, 11: Dm7A, 17: Bm7b5, 26: CM7G},
                                            {1: G7D, 15: CM9, 28: Am7G, 35: G7D, 40: G7}
                                        ],
                                        [
                                            {1: CM9, 13: CM7E, 22: Dm7, 37: G7},
                                            {1: CM9, 14: FM7, 21: Am7G, 36: G7D},
                                            {1: Am7E, 17: Am7G, 34: G7D, 43: Em7},
                                            {1: CM9, 21: Am7, 34: G7D, 46: CM7}
                                        ],
                                        [
                                            {1: CM9, 13: FM7, 22: G7, 24: E7, 29: CM7}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "Rose Rose I love you  with an aching heart",
                                "What is your future  now we have to part",
                                "Standing on the jetty as the steamer moves away",
                                "Flower of Malaya  I cannot stay",
                                "All my life I  shall remember",
                                "Oriental music and you  in my arms",
                                "Perfumed flowers  in your tresses",
                                "Lotus-scented breezes and swaying palms",
                                "Make way  oh make way  for my Eastern Rose",
                                "Men crowd in dozens  everywhere she goes",
                                "In her rickshaw on the street or in a cabaret",
                                "Please make way for Rose  you can hear them say",
                                "Rose Rose I love you  I love you"
                            ]
                        },
                        postscript:
                        [
                            "I wonder whether slash chords are used in Jazz music... It is said that they are called ",
                            [TAG.q, "Upper Structures"], EMOJI.SURPRISE, PB,
                            "At last, E7 was chosen instead of Em7. Is this the Modal Interchange (or Borrowed Chord) ?"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment: "The melodies in the demo are similar to those in the original."
                        }
                    },
                    ALaYLM:
                    {
                        h2: "As Long as You Love Me",
                        preface:
                        [
                            "There are linking-sounds /ʒju:/ in singing ", [TAG.q, "(... a)s you( ...)"],
                            ". Why are not ", [TAG.q, "(... wha)t"], " & ", [TAG.q, "you( ...)"]," linked as /tʃju:/?"
                        ],
                        section:
                        {
                            score:
                            [
                                {
                                    original: "O0",
                                    chords:
                                    [
                                        [
                                            {10: Asus4, 25: CM7, 39: FM7A, 51: GD},
                                            {5: DmA, 17: G7D, 31: C},
                                            {1: Asus4, 16: CM7, 31: FM7A, 39: G6D},
                                            {1: DmA, 14: G7D, 24: C}
                                        ],
                                        [
                                            {5: Asus4, 20: CM7, 37: FM7A, 43: G6D},
                                            {3: DmA, 18: G7D, 29: C},
                                            {1: Asus4, 21: CM7, 36: FM7A, 42: G6D},
                                            {4: DmA, 21: Gsus4D, 30: C}
                                        ],
                                        [
                                            {3: Am, 16: F},
                                            {4: C},
                                            {4: Am},
                                            {6: G6, 17: C}
                                        ],
                                        [
                                            {3: F},
                                            {4: C},
                                            {15: Am},
                                            {6: Dsus2, 17: Gsus4, 23: C}
                                        ]
                                    ]
                                }
                            ],
                            lyrics:
                            [
                                "Although loneliness has always been a friend of mine",
                                "I'm leavin' my life in your hands",
                                "People say I'm crazy and that I am blind",
                                "Risking it all in a glance",
                                "And how you got me blind is still a mystery",
                                "I can't get you out of my head",
                                "Don't care what is written in your history",
                                "As long as you're here with me",
                                "I don't care who you are",
                                "Where you're from",
                                "What you did",
                                "As long as you love me",
                                "Who you are",
                                "Where you're from",
                                "Don't care what you did",
                                "As long as you love me"
                            ]
                        },
                        postscript:
                        [
                            "It also seems good that only 1 chord is chosen for each measure of the verse. " +
                            "Here 2 chords are done for almost every measure.", PB,
                            "There are several different chords for the similar melodies in the verse. " +
                            "So it is with the ones in the chorus."
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment: "The intro can be applied to an outro."
                        }
                    }
                }
            }
        }
    },
    lied:
    {
        language: "de",
        nav: "Lied",
        header: {h1: "Lied"},
        main:
        {
            DKKvM:
            {
                h2: "Die Kleine Kuh von Malibu",
                preface: "Die Kleine Kuh von Malibu - Muh Muh Muh",
                section:
                {
                    score:
                    [
                        {
                            original: "V0",
                            chords:
                            [
                                [
                                    {4: G6, 14: Dadd9Fs},
                                    {4: Dadd9Fs, 15: G6},
                                    {4: G6, 14: Dadd9Fs},
                                    {7: D6A, 19: G, 22: G7B}
                                ],
                                [
                                    {5: C, 20: G6},
                                    {5: D7, 16: Gadd11B},
                                    {5: C, 20: G6},
                                    {7: D6, 20: G}
                                ]
                            ]
                        }
                    ],
                    lyrics:
                    [
                        "In Malibu  in Malibu",
                        "da lebte eine kleine Kuh",
                        "In Malibu  in Malibu",
                        "lebte eine kleine Kuh",
                        "Die kleine Kuh von Malibu",
                        "von Malibu  von Malibu",
                        "Die kleine Kuh von Malibu",
                        "hatte einen Fußballschuh"
                    ]
                },
                postscript: "...",
                details:
                {
                    demo: TAG.audio,
                    comment: "..."
                }
            }
        }
    },
    chanson:
    {
        language: "fr",
        nav: "Chanson",
        header: {h1: "Chanson"},
        main:
        {
            JMaH:
            {
                h2: "Je M'appelle Hélène",
                preface: "...",
                section:
                {
                    score:
                    [
                        {
                            original: "W2",
                            arranged: "V0",
                            chords:
                            [
                                [
                                    {1: GB, 21: DFs},
                                    {10: C, 29: GB, 31: DFs},
                                    {7: CG, 18: DFs, 25: GB, 28: Em},
                                    {7: CG, 17: DFs, 24: G, 27: G7}
                                ],
                                [
                                    {1: C},
                                    {12: GD},
                                    {15: D7A},
                                    {11: GB, 15: D7Fs, 16: G7}
                                ],
                                [
                                    {1: C, 22: Cm},
                                    {13: A7},
                                    {13: sFm7b5C, 30: Cadd9E},
                                    {12: Dsus2A, 36: D7}
                                ],
                                [
                                    {1: G, 18: DA},
                                    {12: C, 33: GB, 35: DA},
                                    {10: C, 17: D6A, 24: GB, 27: Em},
                                    {10: C, 17: Dsus4, 24: G, 27: C, 28: GB}
                                ]
                            ]
                        }
                    ],
                    lyrics:
                    [
                        "Hélène  Je m'appelle Hélène",
                        "Je suis une fille  Comme les autres",
                        "Je voudrais trouver l'amour",
                        "Simplement trouver l'amour",
                        "Et même",
                        "Si j'ai ma photo",
                        "Dans tous les journaux",
                        "Chaque semaine",
                        "Personne  ne m'attend le soir",
                        "Quand je rentre tard",
                        "Personne ne fait battre mon cœur",
                        "Lorsque s'eteignent les projecteurs",
                        "Hélène  Et toutes mes peines",
                        "Trouveront l'oubli  Un jour ou l'autre",
                        "Quand je trouverai l'amour",
                        "Quand je trouverai l'amour"
                    ]
                },
                postscript: "...",
                details:
                {
                    demo: TAG.audio,
                    comment: "..."
                }
            }
        }
    }
};
